[
  {
    "id": "adad580f-76b0-4502-bd05-20c125de9116",
    "title": "Wages ",
    "description": "The wages on the Job Bank website are specific to an occupation and provide information on the earnings of workers at the regional level. Wages for most occupations are also provided at the national and provincial level. In Canada, all jobs are associated with one specific occupational grouping which is determined by the National Occupational Classification. For most occupations, a minimum, median and maximum wage estimates are displayed. They are update annually.\r\n\r\nIf you have comments or ques",
    "organization": "Government of Canada",
    "lastModified": "2025-11-19T15:21:45.787073",
    "created": "2018-01-22T15:50:11.572271",
    "url": "https://open.canada.ca/data/en/dataset/adad580f-76b0-4502-bd05-20c125de9116",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "0e3ba082-a963-4771-95a2-accc43ae244c",
    "title": "Occupational injuries",
    "description": "The dataset shows claims for occupational injuries registered in one calendar year and admitted no later than March 1 of the following year. \r\n\r\nOccupational injuries are recorded in CNESST systems following the receipt of claims.\r\n\r\nThese claims represent workers who were covered by the occupational health and safety insurance plan for which the CNESST is responsible.\r\n\r\nThe _Law on Industrial Accidents and Occupational Diseases_ (LATMP) aims to compensate for occupational injuries and the cons",
    "organization": "Government of Canada",
    "lastModified": "2025-11-12T17:01:17.640455",
    "created": "2022-11-30T15:01:26.015020",
    "url": "https://open.canada.ca/data/en/dataset/0e3ba082-a963-4771-95a2-accc43ae244c",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "f49335d5-738a-4f2e-9204-9dee085c27fc",
    "title": "Infrastructure Economic Accounts, economic impact by asset, industry, and asset function",
    "description": "The economic contribution as a result of the production of infrastructure assets due to investment is presented for valued added (GDP), compensation of employees and number of jobs. Value-added is a key measure of economic performance. It represents the output of an industry minus the value of intermediate inputs that were used up in the production of the goods and services. Within the Infrastructure Economic Accounts, this is the value added due to an industry's production of infrastructure ass",
    "organization": "Government of Canada",
    "lastModified": "2025-06-13T12:46:49.962786",
    "created": "2019-04-17T12:56:29.264211",
    "url": "https://open.canada.ca/data/en/dataset/f49335d5-738a-4f2e-9204-9dee085c27fc",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "390ee890-59bb-4f34-a37c-9732781ef8a0",
    "title": "Historical minimum wage rates in Canada",
    "description": "The minimum wage is a basic labour standard that sets the lowest wage rate that an employer can pay to employees who are covered by the legislation. Today, one of its main purposes is to protect non-unionized workers in unskilled jobs, although it can also influence, directly or indirectly, the level of compensation of other employees as well. \r\nA minimum wage constitutes a floor above which employees or their unions may negotiate with management for higher remuneration. However, it is rarely st",
    "organization": "Government of Canada",
    "lastModified": "2025-05-05T18:30:57.121489",
    "created": "2016-09-24T09:06:01.828711",
    "url": "https://open.canada.ca/data/en/dataset/390ee890-59bb-4f34-a37c-9732781ef8a0",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "a2772d8c-48be-4d39-bcf2-dafca456d724",
    "title": "Employer Records",
    "description": "The data is based information reported to Workers’ Compensation Board by March 31 for employers who are required to have WCB accounts. The dataset contain employer-specific information on occupational fatality, lost-time and disabling injury claims and presented as counts and rates. This information allows for the tracking of workplace health and safety performance indicators over time.",
    "organization": "Government of Canada",
    "lastModified": "2025-01-22T19:32:08.694470",
    "created": "2018-06-27T19:49:25.233190",
    "url": "https://open.canada.ca/data/en/dataset/a2772d8c-48be-4d39-bcf2-dafca456d724",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "e9b7549f-6799-4320-bba4-3ff9dbd01bc9",
    "title": "Federal Jurisdiction Workplace Survey 2015",
    "description": "The purpose of the Federal Jurisdiction Workplace Survey is to produce statistical information on the characteristics of workplaces under federal labour jurisdiction. The data is used by Employment and Social Development Canada for policy research and development.",
    "organization": "Government of Canada",
    "lastModified": "2024-11-21T01:28:05.855918",
    "created": "2019-10-18T13:40:35.109782",
    "url": "https://open.canada.ca/data/en/dataset/e9b7549f-6799-4320-bba4-3ff9dbd01bc9",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "b0e4161f-5ed4-4bac-9985-e1b17549e0b6",
    "title": "Federal Jurisdiction Workplace Survey 2004",
    "description": "The purpose of the Federal Jurisdiction Workplace Survey is to produce statistical information on the characteristics of workplaces under federal labour jurisdiction. The data is used by Employment and Social Development Canada for policy research and development.",
    "organization": "Government of Canada",
    "lastModified": "2024-11-21T01:27:46.137322",
    "created": "2019-10-18T13:43:17.587223",
    "url": "https://open.canada.ca/data/en/dataset/b0e4161f-5ed4-4bac-9985-e1b17549e0b6",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "9792ee78-88d8-451b-b8b0-5af9484b6291",
    "title": "The effectiveness of regulatory inspections in reducing work injuries in Alberta",
    "description": "The Inspections Evaluation Analytical Dataset is an administrative dataset structured at the level of the employer-industry-year-month using a combination of data from employer and claim-level workers compensation data, and OHS regulatory enforcement activity. The underlying data were provided to the Partnership for Work, Health and Safety (PWHS) by the Alberta Workers Compensation Board (WCB) and the Government of Alberta for the purposes of conducting an evaluation of the effect of regulatory ",
    "organization": "Government of Canada",
    "lastModified": "2024-07-24T18:39:25.812297",
    "created": "2024-05-29T18:31:58.266765",
    "url": "https://open.canada.ca/data/en/dataset/9792ee78-88d8-451b-b8b0-5af9484b6291",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "64bf8f8b-3742-4d1c-a6e0-1cc8a71b8c6f",
    "title": "Non-reported work-related injuries among Licensed Practical Nurses",
    "description": "The OHS Futures Research Funding Program provided a grant to the researcher. The researcher used the grant to study factors associated with Licensed Practical Nurses filing injury claims to the Worker’s Compensation Board of Alberta. This dataset provides some of the information collected during this study.",
    "organization": "Government of Canada",
    "lastModified": "2024-07-24T18:36:52.925699",
    "created": "2023-04-05T20:34:13.607397",
    "url": "https://open.canada.ca/data/en/dataset/64bf8f8b-3742-4d1c-a6e0-1cc8a71b8c6f",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "2fa05004-c935-44b5-92af-6570752cbe16",
    "title": "Human resource management practices and work injury rates in Alberta small and medium-sized firms",
    "description": "The dataset links data from two sources of information: (1) individuals with executive titles in a sample of small to medium- sized enterprises in Alberta were surveyed in 2016 and 2018 about their organization's human resource management practices, and (2) archival organizational-level injury data from Alberta Workers' Compensation Board from 2014 to 2019. Thus, the purpose of this dataset is to connect human resource management practices with injury data at the organizational level in a sample",
    "organization": "Government of Canada",
    "lastModified": "2024-07-24T18:34:00.651750",
    "created": "2024-05-29T18:31:45.417666",
    "url": "https://open.canada.ca/data/en/dataset/2fa05004-c935-44b5-92af-6570752cbe16",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workers compensation"
  },
  {
    "id": "32345685-dcf5-4c6e-922d-8a8e195d82a5",
    "title": "Canada Pension Plan (CPP) - Number of CPP recipients by benefit type and gender",
    "description": "Data on the number of recipients of CPP Retirement, Disability and Survivor benefits by gender for the month of June from 1981 to 2025.",
    "organization": "Government of Canada",
    "lastModified": "2025-07-07T19:31:01.331296",
    "created": "2016-09-24T08:00:41.111328",
    "url": "https://open.canada.ca/data/en/dataset/32345685-dcf5-4c6e-922d-8a8e195d82a5",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "f1df637b-5c1a-43b5-8867-32b15b633a7a",
    "title": "Average monthly payments for new Canada Pension Plan (CPP) disability beneficiaries by age group, gender and calendar year ($)",
    "description": "The Canada Pension Plan (CPP) disability benefit is a monthly payment made to eligible CPP contributors who are unable to work regularly at any job because of a severe and prolonged disability. This dataset provides information on the average monthly amount paid to new CPP disability beneficiaries during a calendar year, from 2010 to 2024. Data are disaggregated by age group and gender. Payments made under international agreements on social security are not included.",
    "organization": "Government of Canada",
    "lastModified": "2025-02-20T21:20:59.249506",
    "created": "2023-12-15T21:01:52.217038",
    "url": "https://open.canada.ca/data/en/dataset/f1df637b-5c1a-43b5-8867-32b15b633a7a",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "86a9d46f-5e4c-479a-bfb5-36ec15bcae42",
    "title": "Average monthly payments for new Canada Pension Plan (CPP) disability beneficiaries by province, gender and calendar year ($)",
    "description": "The Canada Pension Plan (CPP) disability benefit is a monthly payment made to eligible CPP contributors who are unable to work regularly at any job because of a severe and prolonged disability. This dataset provides information on the average monthly amount paid to new CPP disability beneficiaries during a calendar year, from 2010 to 2024. Data are disaggregated by province and gender. Payments made under international agreements on social security are not included.",
    "organization": "Government of Canada",
    "lastModified": "2025-02-20T21:20:53.355632",
    "created": "2023-12-15T21:02:08.855811",
    "url": "https://open.canada.ca/data/en/dataset/86a9d46f-5e4c-479a-bfb5-36ec15bcae42",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "3bcb3cd0-296b-4095-96a3-c8bb17495e47",
    "title": "Average monthly payments for Canada Pension Plan (CPP) disability beneficiaries by age group, gender and calendar year ($)",
    "description": "The Canada Pension Plan (CPP) disability benefit is a monthly payment made to eligible CPP contributors who are unable to work regularly at any job because of a severe and prolonged disability. This dataset provides information on the average monthly amount paid to CPP disability beneficiaries during a calendar year, from 2010 to 2024. Data are disaggregated by age group and gender. Payments made under international agreements on social security are not included.",
    "organization": "Government of Canada",
    "lastModified": "2025-02-20T21:10:56.522097",
    "created": "2023-12-15T21:02:13.010247",
    "url": "https://open.canada.ca/data/en/dataset/3bcb3cd0-296b-4095-96a3-c8bb17495e47",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "9e394e89-8929-442b-ab45-4f0cb08f4da5",
    "title": "Average monthly payments for Canada Pension Plan (CPP) disability beneficiaries by province, gender, and calendar year ($)",
    "description": "The Canada Pension Plan (CPP) disability benefit is a monthly payment made to eligible CPP contributors who are unable to work regularly at any job because of a severe and prolonged disability. This dataset provides information on the average monthly amount paid to CPP disability beneficiaries during a calendar year, from 2010 to 2024. Data are disaggregated by province and gender. Payments made under international agreements on social security are not included.",
    "organization": "Government of Canada",
    "lastModified": "2025-02-20T21:10:53.168959",
    "created": "2023-12-15T21:01:56.068834",
    "url": "https://open.canada.ca/data/en/dataset/9e394e89-8929-442b-ab45-4f0cb08f4da5",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "15e31370-ac4a-45a6-926b-02dd372bfd7a",
    "title": "Monthly average number of Canada Pension Plan (CPP) disability benefits by province, gender, and calendar year",
    "description": "The Canada Pension Plan (CPP) disability benefit is a monthly payment made to eligible CPP contributors who are unable to work regularly at any job because of a severe and prolonged disability. This dataset provides information on the monthly average number of recipients of CPP disability benefit during a calendar year, from 2010 to 2024. Data are disaggregated by province and gender. Benefits paid under international agreements on social security are not included.",
    "organization": "Government of Canada",
    "lastModified": "2025-02-20T21:00:51.847176",
    "created": "2023-12-15T21:02:04.679870",
    "url": "https://open.canada.ca/data/en/dataset/15e31370-ac4a-45a6-926b-02dd372bfd7a",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "e6c250de-a41e-4c29-bf80-ee7c22d79c52",
    "title": "Net amount paid for Canada Pension Plan (CPP) disability benefits by province and calendar year ($'000)",
    "description": "The Canada Pension Plan (CPP) disability benefit is a monthly payment made to eligible CPP contributors who are unable to work regularly at any job because of a severe and prolonged disability. This dataset provides information on the net amount paid to all CPP disability beneficiaries during a calendar year, from 1970 to 2023. Data are disaggregated by province. Payments made under international agreements on social security are not included.",
    "organization": "Government of Canada",
    "lastModified": "2025-02-20T20:50:58.387237",
    "created": "2023-12-15T21:02:00.182662",
    "url": "https://open.canada.ca/data/en/dataset/e6c250de-a41e-4c29-bf80-ee7c22d79c52",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "e547539b-7fc6-4879-be54-3d1f80ac9e9e",
    "title": "Canada Pension Plan (CPP) - Statistics on Monthly Maximum Amounts for New Benefits",
    "description": "Employment and Social Development Canada (ESDC) calculates Canada Pension Plan (CPP) monthly maximum benefit amounts for new beneficiaries. CPP monthly maximum new benefit amounts are for recipients starting to receive benefits in a particular month and year. Thereafter, most benefits are indexed annually according to the Consumer Price Index.\r\n\r\nAs of 2019, the CPP is being gradually enhanced every month. CPP benefits now include a base (representing the Plan, as it existed pre-2019) plus an en",
    "organization": "Government of Canada",
    "lastModified": "2025-02-05T16:11:11.598380",
    "created": "2016-09-26T15:21:25.372715",
    "url": "https://open.canada.ca/data/en/dataset/e547539b-7fc6-4879-be54-3d1f80ac9e9e",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "e1319641-0c75-4573-86f7-7f8f20715400",
    "title": "Canada Pension Plan (CPP) - Number of New Disability Benefits by Age, Gender and by Calendar Year",
    "description": "Data on new recipients of CPP Disability benefits by gender, age group and the year when these new benefit recipients came into pay from 1993 to 2024. ",
    "organization": "Government of Canada",
    "lastModified": "2024-12-19T20:00:28.544206",
    "created": "2016-09-26T14:40:23.355730",
    "url": "https://open.canada.ca/data/en/dataset/e1319641-0c75-4573-86f7-7f8f20715400",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "2abf6a97-6c0e-473e-9976-dfa9aba831bf",
    "title": "Canada Pension Plan (CPP) - Disability Benefits by Class of Diagnosis and Age Group",
    "description": "Canada Pension Plan (CPP) Disability Benefits by Class of Diagnosis includes distribution of beneficiaries by age group updated on an annual basis. This annually updated table represents beneficiaries in pay as of December of each year. In order to ensure client confidentiality, an 'X' has been placed where the number of clients  receiving a particular benefit is equal to or below 9. In order to avoid residual disclosure, an 'X' has also been placed where the next number of clients was found, wh",
    "organization": "Government of Canada",
    "lastModified": "2024-12-18T15:41:16.003092",
    "created": "2016-09-24T06:48:24.338299",
    "url": "https://open.canada.ca/data/en/dataset/2abf6a97-6c0e-473e-9976-dfa9aba831bf",
    "source": "open.canada.ca",
    "tags": [],
    "query": "CPP disability"
  },
  {
    "id": "de2bf291-1ccd-4f27-9dcd-8616b95bec6f",
    "title": "Work-Sharing (WS) Program Statistics",
    "description": "The Work-Sharing (WS) Program is an adjustment program through Employment Insurance (EI) involving employers, employees and Service Canada. It is designed to help employers and employees avoid layoffs when there is a temporary reduction in the normal level of business activity that is beyond the control of the employer. \r\n\r\nEmployment and Social Development Canada (ESDC) has compiled data on various metrics related to WS applications and agreements. We have also archived statistics related to th",
    "organization": "Government of Canada",
    "lastModified": "2025-12-09T16:40:52.059318",
    "created": "2020-10-16T12:40:13.829931",
    "url": "https://open.canada.ca/data/en/dataset/de2bf291-1ccd-4f27-9dcd-8616b95bec6f",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "a5dd7bcb-88aa-4a59-a8b1-b37f84a04bfb",
    "title": "Regional unemployment rates used by the Employment Insurance program, three-month moving average, seasonally adjusted",
    "description": "Regional unemployment rates used by the Employment Insurance program, by effective date, current month.<br>",
    "organization": "Government of Canada",
    "lastModified": "2025-12-05T13:46:56.257918",
    "created": "2018-06-27T16:14:16.945795",
    "url": "https://open.canada.ca/data/en/dataset/a5dd7bcb-88aa-4a59-a8b1-b37f84a04bfb",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "4c6c515f-7c44-4bb6-ab56-c5f79f75f705",
    "title": "Property and casualty companies",
    "description": "All publicly available financial data as filed by federally regulated property and casualty insurance companies are available free of charge from the Beyond 20/20 Web site.\r\n\r\nIndustry Totals: Please note that to determine total industry data, you must add “Total Canadian P&C”, “Total Foreign P&C” and “Total Canadian Mortgage Insurers”.\r\n(Up to and including Q4 2017, “Total Canadian P&C Companies” industry total included Canadian mortgage insurers’ data.)\r\n(Effective Q1 2018, to determine “Total",
    "organization": "Government of Canada",
    "lastModified": "2025-12-03T17:52:31.536210",
    "created": "2025-09-29T11:48:27.302410",
    "url": "https://open.canada.ca/data/en/dataset/4c6c515f-7c44-4bb6-ab56-c5f79f75f705",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "1358284b-26e7-4c69-abd8-398d3da2c270",
    "title": "Life insurance companies",
    "description": "All publicly available financial data as filed by federally regulated life insurance companies are available free of charge from the Beyond 20/20 Web site.\r\n\r\nIndustry Totals: Please note that to determine total industry data, you must add \"Total Canadian Life Companies\" and \"Total Foreign Life Companies\".\r\n\r\n(For 2023 reporting year, insurers with a December fiscal year-end will begin filing the new IFRS 17 return versions effective Q1 2023 and insurers with an October fiscal year-end are requi",
    "organization": "Government of Canada",
    "lastModified": "2025-12-03T17:52:20.305932",
    "created": "2025-09-29T12:30:41.526581",
    "url": "https://open.canada.ca/data/en/dataset/1358284b-26e7-4c69-abd8-398d3da2c270",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "7ad44bfe-aa26-4b5b-930b-e7845023dd4c",
    "title": "Fraternal benefit societies",
    "description": "All publicly available financial data as filed by federally regulated fraternal benefit societies are available free of charge from the Beyond 20/20 Web site.\r\n\r\nIndustry Totals: Please note that to determine total industry data, you must add \"Total Canadian Fraternal Benefit Societies\" and \"Total Foreign Fraternal Benefit Societies\".\r\n\r\n\r\nThird-Party Information Liability Disclaimer\r\nFor periods beginning in fiscal 2023 (January 2023 for calendar year-ends; November 2023 for October year-ends) ",
    "organization": "Government of Canada",
    "lastModified": "2025-12-03T17:52:15.124273",
    "created": "2025-09-29T12:22:18.140869",
    "url": "https://open.canada.ca/data/en/dataset/7ad44bfe-aa26-4b5b-930b-e7845023dd4c",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "a0b7803d-f879-4f5a-ace9-5ecb19f7d1e4",
    "title": "Employment insurance beneficiaries (regular benefits) by province, territory and occupation, monthly, seasonally adjusted",
    "description": "Number of employment insurance beneficiaries receiving regular income benefits, by province, territory and National Occupational Classification (NOC), seasonally adjusted, last 5 months.<br>",
    "organization": "Government of Canada",
    "lastModified": "2025-11-20T15:32:33.202632",
    "created": "2024-07-18T14:02:11.989185",
    "url": "https://open.canada.ca/data/en/dataset/a0b7803d-f879-4f5a-ace9-5ecb19f7d1e4",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "e4d6b09c-b183-483b-8471-6df57682d089",
    "title": "Employment insurance beneficiaries (regular benefits) by province, territory and occupation, monthly, unadjusted for seasonality",
    "description": "Number of employment insurance beneficiaries receiving regular income benefits, by province, territory and National Occupational Classification (NOC), last 5 months.<br>",
    "organization": "Government of Canada",
    "lastModified": "2025-11-20T15:32:32.803661",
    "created": "2024-07-18T14:02:11.452859",
    "url": "https://open.canada.ca/data/en/dataset/e4d6b09c-b183-483b-8471-6df57682d089",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "33e18cfa-afd6-4456-97cd-9bdcffdb4139",
    "title": "Employment insurance beneficiaries (regular benefits) by census metropolitan category, monthly, seasonally adjusted",
    "description": "Number of employment insurance beneficiaries receiving regular income benefits by census metropolitan category, last 5 months.<br>",
    "organization": "Government of Canada",
    "lastModified": "2025-11-20T15:32:32.403512",
    "created": "2024-07-18T14:02:10.930521",
    "url": "https://open.canada.ca/data/en/dataset/33e18cfa-afd6-4456-97cd-9bdcffdb4139",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "281063f6-ddab-46a4-8a23-26a4250ec905",
    "title": "Employment insurance beneficiaries by census metropolitan category, monthly, unadjusted for seasonality",
    "description": "Number of employment insurance beneficiaries by census metropolitan category, total and regular income benefits, declared earnings, sex, and age group, last 5 months.<br>",
    "organization": "Government of Canada",
    "lastModified": "2025-11-20T15:32:31.982379",
    "created": "2024-07-18T14:02:10.389831",
    "url": "https://open.canada.ca/data/en/dataset/281063f6-ddab-46a4-8a23-26a4250ec905",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "cf441b48-129d-4561-8523-6ee617897adf",
    "title": "Employment Insurance beneficiaries by employment insurance region, monthly, unadjusted for seasonality",
    "description": "<p>Number of employment insurance beneficiaries by employment insurance region, total and regular income benefits, declared earnings, sex, and age group, last 5 months.<br>\n</p>\n",
    "organization": "Government of Canada",
    "lastModified": "2025-11-20T15:32:31.571456",
    "created": "2020-04-16T12:39:14.030334",
    "url": "https://open.canada.ca/data/en/dataset/cf441b48-129d-4561-8523-6ee617897adf",
    "source": "open.canada.ca",
    "tags": [],
    "query": "employment insurance"
  },
  {
    "id": "cbb4d08c-4e56-4b07-9db6-48335241b88a",
    "title": "Ontario COVID-19 zones",
    "description": "On November 3, 2020, Ontario released a COVID-19 Response Framework which categorized public health unit regions into five zones: * Green-Prevent * Yellow-Protect * Orange-Restrict * Red-Control * Grey-Lockdown For each zone, there were different public health and workplace safety measures for businesses and organizations. Data includes: * Public Health Unit (PHU) * PHU’s website * COVID-19 zone __We are no longer updating this data. It is best suited for historical research and analysis.__",
    "organization": "Government of Canada",
    "lastModified": "2025-11-19T13:01:14.326254",
    "created": "2021-02-10T19:47:17.242973",
    "url": "https://open.canada.ca/data/en/dataset/cbb4d08c-4e56-4b07-9db6-48335241b88a",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "5472ffc1-88e2-48ca-bc9f-4aa249c1298d",
    "title": "Ontario COVID-19 outbreaks data",
    "description": "This dataset compiles daily snapshots of publicly reported data on 2019 Novel Coronavirus (COVID-19) outbreaks in Ontario. [Learn how the Government of Ontario is helping to keep Ontarians safe during the 2019 Novel Coronavirus outbreak]( https://covid-19.ontario.ca/) Data includes: * Summary of cases associated with outbreaks, by outbreak setting and date * Summary of ongoing outbreaks by outbreak setting * Summary of ongoing outbreaks by Public Health Unit (PHU) **As of June 16, all COVID-19 d",
    "organization": "Government of Canada",
    "lastModified": "2025-11-19T13:00:59.447164",
    "created": "2021-02-10T19:46:22.952287",
    "url": "https://open.canada.ca/data/en/dataset/5472ffc1-88e2-48ca-bc9f-4aa249c1298d",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "d9842dc7-bd5c-4335-a595-d953f037bdf2",
    "title": "Deaths accepted",
    "description": "The dataset shows __death claims__ accepted by the CNESST from January 1 to December 31.\r\n\r\nThe CNESST administers the occupational health and safety regime. The _Law on Industrial Accidents and Occupational Diseases_ (LATMP) aims to compensate for occupational injuries and the consequences they cause for beneficiaries. The death claims presented in the dataset meet the following criteria:\r\n \r\n* They are the consequence of a work accident or an occupational disease within the meaning of the LATM",
    "organization": "Government of Canada",
    "lastModified": "2025-11-12T17:04:31.370045",
    "created": "2022-03-16T10:05:30.830217",
    "url": "https://open.canada.ca/data/en/dataset/d9842dc7-bd5c-4335-a595-d953f037bdf2",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "055575da-759b-4e64-b869-0ea7b1842748",
    "title": "Prevention and inspection interventions",
    "description": "The dataset contains __prevention and inspection intervention files__ created from January 1 to December 31. \r\n\r\nThe Commission on Standards, Equity, Health and Safety at Work (CNESST) focuses on the management of prevention by employers and workers and on the establishment or construction site of a prevention program or action plan. To carry out its mission, the CNESST carries out interventions in workplaces.\r\n\r\nThe assignment of files to the inspector takes into account the organization's guid",
    "organization": "Government of Canada",
    "lastModified": "2025-11-12T17:01:08.454146",
    "created": "2022-03-16T10:00:24.539984",
    "url": "https://open.canada.ca/data/en/dataset/055575da-759b-4e64-b869-0ea7b1842748",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "404fbfa7-6954-489b-bf92-9a5efa36dbf4",
    "title": "Recognized Employers Under the Supporting Ontario’s Safe Employers Program",
    "description": "[Supporting Ontario’s Safe Employers](https://www.ontario.ca/page/supporting-ontarios-safe-employers-program) is a voluntary program that promotes health and safety in the workplace and helps reduce injuries and illness. The Ministry of Labour, Immigration, Training and Skills Development runs the program under the direction of the Chief Prevention Officer (CPO). Employers that are recognized by the program have successfully implemented an occupational health and safety management system and [me",
    "organization": "Government of Canada",
    "lastModified": "2025-11-12T13:01:14.882691",
    "created": "2023-05-17T08:01:21.372318",
    "url": "https://open.canada.ca/data/en/dataset/404fbfa7-6954-489b-bf92-9a5efa36dbf4",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "de113672-d813-4a88-965a-d99922485812",
    "title": "The Canadian Radiological Monitoring Network - Pilot Program for Radioactivity in Atmospheric Deposition",
    "description": "Health Canada’s Canadian Radiological Monitoring Network (CRMN) is a national network that routinely collects environmental samples for radioactivity analysis. More information about the CRMN network can be found here: https://www.canada.ca/en/health-canada/services/environmental-workplace-health/environmental-contaminants/environmental-radiation/canadian-radiological-monitoring-network.html As part of the regular network, deposition samples are collected from all stations and analysed on an as-",
    "organization": "Government of Canada",
    "lastModified": "2025-10-30T13:10:46.598778",
    "created": "2023-03-21T21:10:30.985823",
    "url": "https://open.canada.ca/data/en/dataset/de113672-d813-4a88-965a-d99922485812",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "f3e63186-8401-4c9e-a490-1f9e7d7eb00b",
    "title": "Occupational Health and Safety worker fatality and critical injury counts report",
    "description": "The numbers reflect incidents that were reported to and tracked by the Ministry of Labour. They exclude death from natural causes, death of non- workers at a workplace, suicides, death as a result of a criminal act or traffic accident (unless the OHSA is also implicated) and death from occupational exposures that occurred in the past. Data from the Ministry of Labour reflects Occupational Health and Safety (OHS) and Employment Standards (ES) information at a point in time and/or for specific rep",
    "organization": "Government of Canada",
    "lastModified": "2025-10-29T12:01:42.596713",
    "created": "2021-01-27T16:35:30.364834",
    "url": "https://open.canada.ca/data/en/dataset/f3e63186-8401-4c9e-a490-1f9e7d7eb00b",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "2e1b4a35-ac31-4159-b932-90929ef42510",
    "title": "Coroner’s Inquest Recommendations and Responses",
    "description": "The Coroners Act authorizes the Chief Coroner for Ontario to conduct public inquests before a jury of five (5) community members into deaths occurring at construction and mining sites, in correctional institutions, while in police custody, or involving police use of force. The Chief Coroner also has the authority to conduct discretionary inquests into deaths of public interest. Inquest juries may issue recommendations to parties that, when implemented, are intended to improve the health and safe",
    "organization": "Government of Canada",
    "lastModified": "2025-10-29T12:00:54.379399",
    "created": "2025-04-02T12:01:25.419737",
    "url": "https://open.canada.ca/data/en/dataset/2e1b4a35-ac31-4159-b932-90929ef42510",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "ad0c625b-a525-4ddb-9770-dc3f3a74da4e",
    "title": "Occupational Health and Safety inspections report",
    "description": "The Ministry of Labour inspects workplaces to monitor compliance with occupational health and safety legislation and regulations. These are considered to be proactive field visits. The ministry focuses on workplaces and/or sectors of the economy that have a history of poor compliance or high levels of work-related injuries. Data from the Ministry of Labour reflects Occupational Health and Safety (OHS) and Employment Standards (ES) information at a point in time and/or for specific reporting purp",
    "organization": "Government of Canada",
    "lastModified": "2025-10-22T12:02:18.370718",
    "created": "2021-01-27T16:18:52.344187",
    "url": "https://open.canada.ca/data/en/dataset/ad0c625b-a525-4ddb-9770-dc3f3a74da4e",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "85d990eb-e2a9-48da-bdb6-08e056abed15",
    "title": "Transgender inclusion at Global Affairs Canada: Maddie’s story",
    "description": "At Global Affairs Canada, we celebrate diversity in all its forms. In this story, we highlight resilience, celebrate talent and address the issue of workplace transition for transgender people.",
    "organization": "Government of Canada",
    "lastModified": "2025-10-19T13:40:45.938855",
    "created": "2023-07-19T17:11:58.844825",
    "url": "https://open.canada.ca/data/en/dataset/85d990eb-e2a9-48da-bdb6-08e056abed15",
    "source": "open.canada.ca",
    "tags": [],
    "query": "workplace safety"
  },
  {
    "id": "508edfe7-0cba-4d76-afe8-d19e42e9df8a",
    "title": "Ministers’ offices expenses",
    "description": "The dataset of “Ministers’ offices expenses” contains an annual report of all expenses incurred by the office of a head of a department or a ministry of state for the Government of Canada and charged to the Consolidated Revenue Fund. This dataset does not include civilian termination benefits and statutory expenditures such as the Minister's salary and motor vehicle allowance, employer contributions to superannuation and certain benefit plans and other items as specified in these policies.\r\n\r\nTh",
    "organization": "Government of Canada",
    "lastModified": "2025-12-06T06:10:52.632284",
    "created": "2020-07-28T17:40:43.369479",
    "url": "https://open.canada.ca/data/en/dataset/508edfe7-0cba-4d76-afe8-d19e42e9df8a",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "b27ec3ef-7338-4e76-a6fd-128339a92df5",
    "title": "Who we regulate",
    "description": "We regulate and supervise more than 400 financial institutions. In this dataset you’ll find a list of these institutions, updated daily. \r\n\r\nWe regulate and supervise more than 1200 private pension plans for employees working in federally regulated industries. Here you’ll find a list of these plans, updated daily, or see our list of pooled registered pension plans. We’ve excluded some pension plans from the list for privacy reasons.\r\n\r\n",
    "organization": "Government of Canada",
    "lastModified": "2025-12-01T14:20:54.236932",
    "created": "2025-05-29T16:41:05.897198",
    "url": "https://open.canada.ca/data/en/dataset/b27ec3ef-7338-4e76-a6fd-128339a92df5",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "9dced3ef-09b6-4733-827b-d24bfaaa2897",
    "title": "Veterans Affairs Canada Audit of Overpayments - February 2014",
    "description": "The purpose of this audit is to provide assurance that departmental activities with respect to the processing of overpayments are in compliance with policies, procedures, and regulations. The audit reviewed the overpayments of four programs: Disability Award, Disability Pension, War Veterans Allowance, and Earnings Loss.\r\n\r\nAn overpayment is any amount paid to a beneficiary to which there is no entitlement, or which exceeds entitlement and are \"debts to the Crown\". Veterans Affairs Canada is req",
    "organization": "Government of Canada",
    "lastModified": "2025-11-29T14:00:44.995559",
    "created": "2017-07-05T20:30:19.828169",
    "url": "https://open.canada.ca/data/en/dataset/9dced3ef-09b6-4733-827b-d24bfaaa2897",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "9d7e0e0a-79df-46ba-ac34-127c398903bc",
    "title": "Veterans Affairs Canada Evaluation of Disability Benefits - August 2015",
    "description": "The evaluation of the Disability Benefits program was conducted in accordance with the Veterans Affairs Canada (VAC) Multi-Year Risk-Based Evaluation Plan 2014–19. \r\n\r\nThe objective of the Disability Benefits program is to compensate Veterans/members and other individuals in recognition of the effects of service-related disabilities, death or incarceration/evasion/escape. \r\n\r\nThe Disability Benefits program consists of both the Disability Pension and the Disability Award. The Pension Act of 1919",
    "organization": "Government of Canada",
    "lastModified": "2025-11-29T14:00:44.652066",
    "created": "2017-07-04T19:51:23.375232",
    "url": "https://open.canada.ca/data/en/dataset/9d7e0e0a-79df-46ba-ac34-127c398903bc",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "927c1996-de27-4da1-bf26-e13c1db78945",
    "title": "Veterans Affairs Canada Evaluation of Disability Pensions and Awards - August 2010",
    "description": "The evaluation of Veterans Affairs Canada’s (VAC) Disability Pension and Disability Award Programs originated in the requirement to support the renewal of the Terms and Conditions of the Disability Award Program by March 2011. The Disability Award Program is part of the New Veterans Charter (NVC) suite of programs introduced in 2006 in order to meet the needs of a shifting client demographic. The NVC represents the most sweeping changes to Veterans’ benefits and services in the past 60 years.\r\n",
    "organization": "Government of Canada",
    "lastModified": "2025-11-29T13:50:48.258366",
    "created": "2017-08-10T14:29:33.167853",
    "url": "https://open.canada.ca/data/en/dataset/927c1996-de27-4da1-bf26-e13c1db78945",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "8cb7089e-bea8-4979-8c89-cfee74aa4bb4",
    "title": "Veterans Affairs Canada Audit of Earnings Loss - May 2013",
    "description": "The Earnings Loss benefit is one of the supports available through Veterans Affairs Canada’s Financial Benefits Program. Earnings Loss is payable in recognition of the economic impact a military career-ending or service-related disability may have on the Veteran’s ability to earn income following release from the Canadian Armed Forces. This income replacement ensures that the eligible Veteran's income does not fall below 75% of their gross pre-release military salary. The guaranteed minimum rate",
    "organization": "Government of Canada",
    "lastModified": "2025-11-29T13:50:47.917747",
    "created": "2017-07-06T14:40:11.314155",
    "url": "https://open.canada.ca/data/en/dataset/8cb7089e-bea8-4979-8c89-cfee74aa4bb4",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "7e8eab73-a760-459e-af34-35d75578b884",
    "title": "Veterans Affairs Canada Evaluation of the Veterans Affairs Canada (VAC)-Service Canada Partnership - December 2015",
    "description": "In 2012, Veterans Affairs Canada (VAC) and Service Canada entered into a Partnership whereby Service Canada would use their web, in-person and telephone services to provide general information on VAC’s benefits and services to individuals who visit Service Canada’s website, visit a Service Canada Centre or call VAC’s toll-free line. In addition, Service Canada would accept and review applications for the Disability Benefits Program and the Veterans Independence Program (VIP). The intention of th",
    "organization": "Government of Canada",
    "lastModified": "2025-11-29T13:50:47.543949",
    "created": "2017-07-04T19:51:45.806543",
    "url": "https://open.canada.ca/data/en/dataset/7e8eab73-a760-459e-af34-35d75578b884",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "1fab2afd-4f3c-4922-a07e-58d7bed9dcfc",
    "title": "Canada Pension Plan (CPP) - Number of Benefits, by Place of Residence and Benefit Type",
    "description": "This dataset provides information on the number of benefits, by place of residence and benefit type for the Canada Pension Plan (CPP).  It is part of the Monthly Canada Pension Plan and Old Age Security Statistical Bulletin - a monthly publication that provides information on the number of benefits and new benefits by place of residence (province). In order to ensure client confidentiality, an 'X' has been placed where the number of clients  receiving a particular benefit is equal to or below 9.",
    "organization": "Government of Canada",
    "lastModified": "2025-11-27T20:01:47.855194",
    "created": "2016-09-24T04:55:07.348983",
    "url": "https://open.canada.ca/data/en/dataset/1fab2afd-4f3c-4922-a07e-58d7bed9dcfc",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "1a63b19e-2a86-4d4d-a36d-93d94f813187",
    "title": "Canada Pension Plan (CPP) - Number of New Benefits, by Place of Residence and Benefit Type",
    "description": "This dataset provides information on the number of new benefits, by place of residence and benefit type for the Canada Pension Plan (CPP). It is part of the Monthly Canada Pension Plan and Old Age Security Statistical Bulletin - a monthly publication that provides information on the number of benefits and new benefits by place of residence (province). In order to ensure client confidentiality, an 'X' has been placed where the number of clients receiving a particular benefit is equal to or below ",
    "organization": "Government of Canada",
    "lastModified": "2025-11-27T20:01:47.289738",
    "created": "2016-09-24T04:03:53.971360",
    "url": "https://open.canada.ca/data/en/dataset/1a63b19e-2a86-4d4d-a36d-93d94f813187",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  },
  {
    "id": "267d0301-fd2f-4565-8c70-2e39190fdb31",
    "title": "Veterans Affairs Canada Audit of Hearing Loss Decisions - December 2014",
    "description": "The Veterans Affairs Canada (VAC) Disability Benefits Program provides eligible Veterans and other qualified individuals with benefits under the Pension Act and the Canadian Forces Members and Veterans Re-establishment and Compensation Act. Hearing Loss is the most claimed service-related medical condition under each of these Acts.\r\n\r\nIn September 2014, in response to findings presented to the Minister regarding the number of Hearing Loss claims being approved in one region of Nova Scotia, the M",
    "organization": "Government of Canada",
    "lastModified": "2025-11-27T17:01:09.325754",
    "created": "2017-07-04T19:51:00.608196",
    "url": "https://open.canada.ca/data/en/dataset/267d0301-fd2f-4565-8c70-2e39190fdb31",
    "source": "open.canada.ca",
    "tags": [],
    "query": "Canada Pension Plan disability"
  }
]