[
  {
    "id": "1oxfwfm",
    "subreddit": "ontario",
    "title": "I’m getting concerned I will never be able to return back to my pre-injury job.",
    "author": "Same-World-5804",
    "url": "https://reddit.com/r/ontario/comments/1oxfwfm/im_getting_concerned_i_will_never_be_able_to/",
    "score": 37,
    "comments": 25,
    "created": "2025-11-15T02:23:12.000Z",
    "text": "I suffered a workplace injury about 9 months ago, where I was immediately receiving WSIB for.  For reference, I suffered from a knee subluxation that doesn’t seem to be recovering very well.\nI have been able to do modified duties for the last 4 months, however my employer claims there is nothing for me, and they expect me to come back to my full capabilities to the job I was hired for.\nI never passed probation and was only days away from passing my training.  I was there almost 5 weeks before I ",
    "keyword": "WSIB"
  },
  {
    "id": "1ony3tg",
    "subreddit": "ontario",
    "title": "Injured at Workplace",
    "author": "OwnConsideration4548",
    "url": "https://reddit.com/r/ontario/comments/1ony3tg/injured_at_workplace/",
    "score": 0,
    "comments": 11,
    "created": "2025-11-04T04:24:40.000Z",
    "text": "I filed for WSIB because my foot got fractured. I have spent $2500 on treatment as I do not have OHIP card and I am on my work permit. Its been 10 days since I am not going to work\n\nWill I get anything?\n\nMy employer has wsib\nBut i am scared because wsib online reviews are not that good ",
    "keyword": "WSIB"
  },
  {
    "id": "1oqgks4",
    "subreddit": "ontario",
    "title": "CDCP Student Eligibility",
    "author": "thats-so-crazy-man",
    "url": "https://reddit.com/r/ontario/comments/1oqgks4/cdcp_student_eligibility/",
    "score": 0,
    "comments": 4,
    "created": "2025-11-07T00:57:11.000Z",
    "text": "I attend school at WLU and have Blue Cross Health and Dental Insurance through the school. \n\nI went to the dentist and they said I'm eligible for CDCP even though I have the Blue Cross and they said it doesn't count.\n\nIs this true? I applied for CDCP anyways but I don't want to get called for fraud if I end up submitting a claim and have to pay back everything\n\n",
    "keyword": "ODSP"
  },
  {
    "id": "1ooijrn",
    "subreddit": "ontario",
    "title": "FRO help",
    "author": "Cheap_Inevitable_248",
    "url": "https://reddit.com/r/ontario/comments/1ooijrn/fro_help/",
    "score": 0,
    "comments": 2,
    "created": "2025-11-04T20:36:10.000Z",
    "text": "A child support payment I was to make got returned due to NSF. I attempted to fund the account right away as soon as I noticed my error. Does anyone know what happens next, will they attempt to take the funds again tomorrow or do I need to contact FRO for an alternative payment method?",
    "keyword": "ODSP"
  },
  {
    "id": "1ood846",
    "subreddit": "ontario",
    "title": "Better Jobs/Second Career",
    "author": "No-Regret-1960",
    "url": "https://reddit.com/r/ontario/comments/1ood846/better_jobssecond_career/",
    "score": 0,
    "comments": 1,
    "created": "2025-11-04T17:21:13.000Z",
    "text": "I’ve been on ODSP for about 10 years. I graduated last year with an honours double major in psychology and religious studies. I started university in 2008 and left because of health reasons one credit short. So last year I finally got around to it and got the credit and graduated. I am in third-party collections for my OSAP So if I wanted to go back to school for anything the only way I could pay for it is using the better jobs program.\n\n  \nI don’t know very much about the program but is it true",
    "keyword": "ODSP"
  },
  {
    "id": "1otvjky",
    "subreddit": "ontario",
    "title": "'Better call Paul,' advocates tell families struggling with school supports for kids with disabilities",
    "author": "sblooo",
    "url": "https://reddit.com/r/ontario/comments/1otvjky/better_call_paul_advocates_tell_families/",
    "score": 13,
    "comments": 0,
    "created": "2025-11-11T00:50:43.000Z",
    "text": "",
    "keyword": "disability support"
  },
  {
    "id": "1onecm9",
    "subreddit": "ontario",
    "title": "When will the provincial hiring freeze end? Does this really help bolster frontline employment?",
    "author": "Antique_Elk_3712",
    "url": "https://reddit.com/r/ontario/comments/1onecm9/when_will_the_provincial_hiring_freeze_end_does/",
    "score": 8,
    "comments": 7,
    "created": "2025-11-03T15:13:21.000Z",
    "text": "I have been working in healthcare for 10+ years. I’ve been working on the frontline support people with mental illness and developmental disabilities. Although I love working on the frontline support people- there are many issues with non-profit agencies where I have been hired. I spent the last six years working in a non-profit telling myself that I will find myself a job where I can advocate and work in one of the provincial governing agencies. This in response to when front line workers advan",
    "keyword": "disability support"
  },
  {
    "id": "1p7hj7x",
    "subreddit": "onguardforthee",
    "title": "Canadian farmers to lobby federal government to cap profits of major grocers",
    "author": "burtzev",
    "url": "https://reddit.com/r/onguardforthee/comments/1p7hj7x/canadian_farmers_to_lobby_federal_government_to/",
    "score": 701,
    "comments": 53,
    "created": "2025-11-26T19:48:51.000Z",
    "text": "",
    "keyword": "disability support"
  },
  {
    "id": "1oy3p5e",
    "subreddit": "legaladvicecanada",
    "title": "Telus employee fell in my yard",
    "author": "TeaEmber",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oy3p5e/telus_employee_fell_in_my_yard/",
    "score": 276,
    "comments": 91,
    "created": "2025-11-15T21:39:09.000Z",
    "text": "A Telus employee came to my door and said they had to gain access to my yard to go up a pole in my yard (for some random customers ticket, not ours). This isn’t unusual, they asked if they could go in my yard through my gate and I said yes. For what it’s worth I do have cameras in the front, side and back that are motion activated and have video of them asking for permission. 7 minutes later they fell off their ladder and they called 911 which we only realized when our notifications went crazy o",
    "keyword": "WSIB"
  },
  {
    "id": "1orvbgg",
    "subreddit": "legaladvicecanada",
    "title": "Denied extended maternity benefits - Ontario",
    "author": "bigfatgoalie_monica",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orvbgg/denied_extended_maternity_benefits_ontario/",
    "score": 19,
    "comments": 39,
    "created": "2025-11-08T17:34:20.000Z",
    "text": "Location: Ontario Canada\n\nMyself and 3 other female employees at my work have just started maternity leave.\n\nOur current collective agreement allows 18 weeks of top up pay while on maternity leave.\n\nWe are entering a new collective agreement as of January 1, in which maternity top up benefits are extended for 40 weeks.\n\nOur association is stating that the small group of pregnant/new moms who are on leave will NOT be entitled to the terms of the new agreement and will only get the 18 weeks that t",
    "keyword": "WSIB"
  },
  {
    "id": "1ozv8wj",
    "subreddit": "legaladvicecanada",
    "title": "Got laid off right after I told my work I was ready to come back after sick leave",
    "author": "HenriettaSyndrome",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ozv8wj/got_laid_off_right_after_i_told_my_work_i_was/",
    "score": 10,
    "comments": 21,
    "created": "2025-11-17T22:56:59.000Z",
    "text": "Had to go on sick leave after hurting my back at work..(CT warewhouse) was on it for the full 6 months and got a doctors note saying I could go back. \n\nMy back isn't actually all the way better, still have sciatica but ei ran out so I felt I had no choice.\n\nAnyway, they left me hanging for a few weeks after I told them I was ready to come back then my manager messaged me today saying I was being laid off and that my ROE was already sent for my sick leave. \n\nSo basically I got laid off immediatel",
    "keyword": "WSIB"
  },
  {
    "id": "1onyrri",
    "subreddit": "legaladvicecanada",
    "title": "Injured myself at workplace",
    "author": "OwnConsideration4548",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onyrri/injured_myself_at_workplace/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-04T05:00:44.000Z",
    "text": "I filed for WSIB because my foot got fractured. I have spent $2500 on treatment as I do not have OHIP card and I am on my work permit. Its been 10 days since I am not going to work\n\nWill I get anything?\n\nMy employer comes under wsib But wsib’s reviews are very negative so i am scared",
    "keyword": "WSIB"
  },
  {
    "id": "1ow9sh0",
    "subreddit": "legaladvicecanada",
    "title": "Off work temporarily due to serious back pain. What are my options? Ontario.",
    "author": "prettygoodprettyneat",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ow9sh0/off_work_temporarily_due_to_serious_back_pain/",
    "score": 0,
    "comments": 6,
    "created": "2025-11-13T19:03:34.000Z",
    "text": "I’ve been off work for the last week due to some major back pain. It is not due to a specific incident just over worked, muscle imbalance and flexibility issues. My employer (construction industry) is fine with this. He said stay home, heal up, we need you back at 100% as soon as possible. I’m hoping I can return early next week. I’ve been seeing physio, chiropractor everyday. Had an X Ray. I could definitely get some kind of formal documentation stating my condition from a medical professional.",
    "keyword": "WSIB"
  },
  {
    "id": "1olx9r7",
    "subreddit": "legaladvicecanada",
    "title": "Brother passed away, late to inform ODSP",
    "author": "svziv",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1olx9r7/brother_passed_away_late_to_inform_odsp/",
    "score": 24,
    "comments": 9,
    "created": "2025-11-01T19:53:13.000Z",
    "text": "Hi everyone,\n\nMy brother passed away at the end of September. It aas a very difficult time for us and I didn't even think about informing everything from the CRA, NSLC to the ODSP. I had informed the bank to close his accounts mid October. I think they had opened an estate account. He had no will, no spouse or kids, no other assets other than whatever is in his bank account and lots of debt (line of credit). The bank told me they are listing me as the executor and that I should apply for probate",
    "keyword": "ODSP"
  },
  {
    "id": "1oltdwk",
    "subreddit": "legaladvicecanada",
    "title": "Fired because of disability limitations - is there anything I can do?",
    "author": "SilverMic",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oltdwk/fired_because_of_disability_limitations_is_there/",
    "score": 2,
    "comments": 51,
    "created": "2025-11-01T17:17:26.000Z",
    "text": "I apologize if some of what I describe is a bit vague, but I'm trying to protect my privacy as much as I can.\n\nNote: I live in Ontario.\n\nI was recently fired from a job that I'd only been working a short time, so I was in the probationary period. They needed to cut some staff, and one of the reasons they chose me was because I asked for certain limitations to my schedule because of my disability. I have a recording of the conversation where I asked if my availability was a factor, and they said ",
    "keyword": "ODSP"
  },
  {
    "id": "1onbrz7",
    "subreddit": "legaladvicecanada",
    "title": "Child support for disabled daughter after primary parent dies",
    "author": "marcalinevmpq",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onbrz7/child_support_for_disabled_daughter_after_primary/",
    "score": 41,
    "comments": 24,
    "created": "2025-11-03T13:29:48.000Z",
    "text": "\nThis is an emotional topic for me, so I have tried my best to remove any emotion and stick to the facts. \n\n\nmy sibling is an adult with permanent disabilities living in a publicly funded group living home in Ontario and our parents are divorced. our dad has tried to skirt his support obligations multiple times.\n\nour mother recently died and before her death my parents reached an agreement where our dad was only required to pay support in the amount of my sisters expenses since she no longer res",
    "keyword": "ODSP"
  },
  {
    "id": "1orabdp",
    "subreddit": "legaladvicecanada",
    "title": "Friend Injured at Work Due to Third-Party Negligence",
    "author": "AvocadoPlastic1087",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orabdp/friend_injured_at_work_due_to_thirdparty/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-07T23:50:34.000Z",
    "text": "Hello everyone,\n\nI’m posting on behalf of a close friend who is very nervous about speaking up or taking legal action regarding a work injury. She was injured at her workplace due to a third-party company’s negligence. They failed to properly secure a work area, which led to an accident that caused serious and lasting injuries to her neck and shoulder.\n\nShe’s wondering if she can take legal action or file a separate claim against the third-party company for additional compensation, benefits, or ",
    "keyword": "injured worker"
  },
  {
    "id": "1onqxr4",
    "subreddit": "legaladvicecanada",
    "title": "Employer's hiring &amp; scheduling dysfunction likely violating employment standards, seeking advice on recourse",
    "author": "olpsv",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onqxr4/employers_hiring_scheduling_dysfunction_likely/",
    "score": 1,
    "comments": 10,
    "created": "2025-11-03T22:58:13.000Z",
    "text": "Hey LAC,\n\nThis post is an update/follow-up to my last post here. I tried to link it, but the link kept breaking Reddit's text editor so I gave up. You can find it in my profile, it's the only other post I've made on this account. It's not important to read it to understand what's going on, but I mention it for posterity (or if a reader wanted a little additional context).   \n\nHere's a bulleted summary of my situation as clearly as I could articulate it:\n\n- I applied to a position on Indeed which",
    "keyword": "injured worker"
  },
  {
    "id": "1onbrz7",
    "subreddit": "legaladvicecanada",
    "title": "Child support for disabled daughter after primary parent dies",
    "author": "marcalinevmpq",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onbrz7/child_support_for_disabled_daughter_after_primary/",
    "score": 41,
    "comments": 24,
    "created": "2025-11-03T13:29:48.000Z",
    "text": "\nThis is an emotional topic for me, so I have tried my best to remove any emotion and stick to the facts. \n\n\nmy sibling is an adult with permanent disabilities living in a publicly funded group living home in Ontario and our parents are divorced. our dad has tried to skirt his support obligations multiple times.\n\nour mother recently died and before her death my parents reached an agreement where our dad was only required to pay support in the amount of my sisters expenses since she no longer res",
    "keyword": "disability support"
  },
  {
    "id": "1p07mjp",
    "subreddit": "legaladvicecanada",
    "title": "Lost and homeless",
    "author": "sarebearxoxo",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p07mjp/lost_and_homeless/",
    "score": 39,
    "comments": 42,
    "created": "2025-11-18T09:33:22.000Z",
    "text": "While I was away on vacation for the first time in many, many years, I got to enjoy some family time with my sister and niece. \n\nMy fiance of almost 5 years texted me and told me that he had changed the locks and that I need to collect my things when I get back. \n\nI was in shock, I tried to call but no answer. \n\nI had one week left in another province with my family and I couldn’t wrap my head around how he could do that to me.\n\nOver the years I have taken care of his elderly parents. Spending c",
    "keyword": "disability support"
  },
  {
    "id": "1okhac7",
    "subreddit": "legaladvicecanada",
    "title": "Disability Accommodations Ontario",
    "author": "llama1122",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1okhac7/disability_accommodations_ontario/",
    "score": 0,
    "comments": 13,
    "created": "2025-10-31T01:06:20.000Z",
    "text": "I’ve been trying to get workplace accommodations for a mental health disability for over a year. I’ve provided multiple medical notes listing my limitations, symptoms, and the recommended need for remote work.\n\nI understand that my employer doesn’t have to approve full remote work, but as I understand it, they do have to review the medical notes and explore effective accommodations based on my individual limitations.\n\nThe accommodations offered are based on stereotypes of my condition not my act",
    "keyword": "disability support"
  },
  {
    "id": "1onkmeq",
    "subreddit": "legaladvicecanada",
    "title": "Trying to get Justice, only getting barricades, looking for guidance",
    "author": "Siletrea",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onkmeq/trying_to_get_justice_only_getting_barricades/",
    "score": 0,
    "comments": 9,
    "created": "2025-11-03T19:00:52.000Z",
    "text": "On behalf of my Gramma I tried to be the pacifist and hold off on pursuing legal aide and help to go after my Abusive spawn point of origin, who used and exploited me in SEVERAL ways while I was living with her.\n\n**Wage Theft**: I was the only employee in a \"family run\" dollarstore for 4 and a half years, worked 7 hours a day 6 days a week, including birthdays and minor holidays with no pay OR any breaks for lunch or to relieve myself. I worked 90% of the positions for the store where the only t",
    "keyword": "disability support"
  },
  {
    "id": "1p126w0",
    "subreddit": "legaladvicecanada",
    "title": "Complaint Respecting a Co-guardian or trustee application",
    "author": "EmmyA1fred",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p126w0/complaint_respecting_a_coguardian_or_trustee/",
    "score": 0,
    "comments": 2,
    "created": "2025-11-19T08:33:41.000Z",
    "text": "Has anyone successfully completed filing &amp; won the “ Complaint Respecting a Co-decision- Maker, Guardian or Trustee” form in Calgary, Alberta King’s Bench (surrogate matter)  against a family member “ Parents” for Guardianship &amp; Trustee of an Adult sibling with severe physical and mental disability? \n\n The reason for filing the complaint is to challenge my “ mother’s “ aka guardianship of my older brother who is 40 years old this January has/ is being neglected “isolation” and not having",
    "keyword": "disability support"
  },
  {
    "id": "1oqi8i6",
    "subreddit": "legaladvicecanada",
    "title": "Abusive Trustee Help Finding Legal Funding Support",
    "author": "HiddenLittleKitten",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oqi8i6/abusive_trustee_help_finding_legal_funding_support/",
    "score": 0,
    "comments": 3,
    "created": "2025-11-07T02:13:28.000Z",
    "text": "Hi, I'm physically disabled and was living with my Dad before he passed away as a disabled financial dependant, I'm currently living in his home that's in my Dad's estate's name and everything I was meant to live on and my medical needs was what my Dad had left behind for me as his only daughter \n\nMy Dad left behind a very dangerous will that has dangerous conflicts of interest against me where my Dad's older brother is the Executor, Trustee, and successor beneficiary that gets everything if I d",
    "keyword": "disability support"
  }
]