[
  {
    "id": "1pbdhbd",
    "subreddit": "canada",
    "title": "'This is the new slavery': Migrant farm workers underpaid, abused and injured",
    "author": "feb914",
    "url": "https://reddit.com/r/canada/comments/1pbdhbd/this_is_the_new_slavery_migrant_farm_workers/",
    "score": 207,
    "comments": 116,
    "created": "2025-12-01T13:59:49.000Z",
    "text": "",
    "keyword": "injured worker"
  },
  {
    "id": "1p7hj7x",
    "subreddit": "onguardforthee",
    "title": "Canadian farmers to lobby federal government to cap profits of major grocers",
    "author": "burtzev",
    "url": "https://reddit.com/r/onguardforthee/comments/1p7hj7x/canadian_farmers_to_lobby_federal_government_to/",
    "score": 708,
    "comments": 52,
    "created": "2025-11-26T19:48:51.000Z",
    "text": "",
    "keyword": "disability support"
  },
  {
    "id": "1orabdp",
    "subreddit": "legaladvicecanada",
    "title": "Friend Injured at Work Due to Third-Party Negligence",
    "author": "AvocadoPlastic1087",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orabdp/friend_injured_at_work_due_to_thirdparty/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-07T23:50:34.000Z",
    "text": "Hello everyone,\n\nI’m posting on behalf of a close friend who is very nervous about speaking up or taking legal action regarding a work injury. She was injured at her workplace due to a third-party company’s negligence. They failed to properly secure a work area, which led to an accident that caused serious and lasting injuries to her neck and shoulder.\n\nShe’s wondering if she can take legal action or file a separate claim against the third-party company for additional compensation, benefits, or ",
    "keyword": "injured worker"
  },
  {
    "id": "1onqxr4",
    "subreddit": "legaladvicecanada",
    "title": "Employer's hiring &amp; scheduling dysfunction likely violating employment standards, seeking advice on recourse",
    "author": "olpsv",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onqxr4/employers_hiring_scheduling_dysfunction_likely/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-03T22:58:13.000Z",
    "text": "Hey LAC,\n\nThis post is an update/follow-up to my last post here. I tried to link it, but the link kept breaking Reddit's text editor so I gave up. You can find it in my profile, it's the only other post I've made on this account. It's not important to read it to understand what's going on, but I mention it for posterity (or if a reader wanted a little additional context).   \n\nHere's a bulleted summary of my situation as clearly as I could articulate it:\n\n- I applied to a position on Indeed which",
    "keyword": "injured worker"
  },
  {
    "id": "1p8nebm",
    "subreddit": "legaladvicecanada",
    "title": "Car accident while on EI",
    "author": "Efficient_Night_1490",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p8nebm/car_accident_while_on_ei/",
    "score": 0,
    "comments": 11,
    "created": "2025-11-28T06:02:03.000Z",
    "text": "I’m looking for advice on how to approach this situation for a family member.\n\nBasic facts. Was injured at work and spent nearly a year in treatment recovering, both physically and mentally. Torn acl. Once recovered and back working full-time, was laid off as part of a very large restructuring.\n\nWas looking for work and still going to treatments less regularly from the workplace accident when they were rear ended at a light and more severely injured.\n\nPhysical injury was worsened on same leg and",
    "keyword": "workplace injury"
  },
  {
    "id": "1orabdp",
    "subreddit": "legaladvicecanada",
    "title": "Friend Injured at Work Due to Third-Party Negligence",
    "author": "AvocadoPlastic1087",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orabdp/friend_injured_at_work_due_to_thirdparty/",
    "score": 1,
    "comments": 10,
    "created": "2025-11-07T23:50:34.000Z",
    "text": "Hello everyone,\n\nI’m posting on behalf of a close friend who is very nervous about speaking up or taking legal action regarding a work injury. She was injured at her workplace due to a third-party company’s negligence. They failed to properly secure a work area, which led to an accident that caused serious and lasting injuries to her neck and shoulder.\n\nShe’s wondering if she can take legal action or file a separate claim against the third-party company for additional compensation, benefits, or ",
    "keyword": "workplace injury"
  },
  {
    "id": "1p5m1x6",
    "subreddit": "legaladvicecanada",
    "title": "[Canada] Friend’s Employer Cancelled Their Pre-Approved Vacation, Forcing In-Office Return Despite Psychological Injury, WCB Involvement, and No Medical Clearance — Looking for Advice",
    "author": "Lower_Lie2128",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p5m1x6/canada_friends_employer_cancelled_their/",
    "score": 0,
    "comments": 4,
    "created": "2025-11-24T16:45:11.000Z",
    "text": "**TL;DR**\n\nMy friend went on medical leave for a psychological injury caused by a supervisor. Their therapist has *not* cleared them to return to the office, and WCB scheduled a medical assessment for after the employer’s planned return date. Despite this, HR cancelled their pre-approved vacation without telling them (causing financial issues and travel conflicts), reduced their vacation balance with no explanation, and is now insisting they return to the office before the medical assessment and",
    "keyword": "workplace injury"
  },
  {
    "id": "1oosz2r",
    "subreddit": "legaladvicecanada",
    "title": "Injury during plasma donation, how do I go about negotiating compensation?",
    "author": "greygirlies",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oosz2r/injury_during_plasma_donation_how_do_i_go_about/",
    "score": 0,
    "comments": 12,
    "created": "2025-11-05T04:02:14.000Z",
    "text": "Hi everyone,\n\nAbout a week ago I donated plasma at a local center. I’ve donated before, so I knew what to expect. When the staff member inserted the needle, it immediately felt wrong. The needle was visibly sticking out and it was painful. I told him multiple times that it hurt, but he brushed it off and said it was fine. About 10–20 minutes into the donation, I was in significant pain and could actually feel the blood moving in and out of my arm, which had never happened before.\n\nWhen he came b",
    "keyword": "workers compensation"
  },
  {
    "id": "1pdo6yh",
    "subreddit": "legaladvicecanada",
    "title": "Harassed at Work, Third-Party Lawyer Backed My Claim. Now I’m Being Asked to Sign a Release. Need Help",
    "author": "mybabyboyblue",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1pdo6yh/harassed_at_work_thirdparty_lawyer_backed_my/",
    "score": 0,
    "comments": 7,
    "created": "2025-12-04T02:31:49.000Z",
    "text": "\nI’m looking for legal guidance in BC regarding workplace harassment, my employer’s investigation, and my options moving forward.\n\nEarlier this year, I experienced repeated inappropriate comments and behaviour from a senior director. The comments were sexualized, directed at me in front of others, and made me uncomfortable enough that I eventually filed a formal harassment complaint through my employer’s process.\n\nThe HR investigation found him responsible since of harassment and he received tra",
    "keyword": "workers compensation"
  },
  {
    "id": "1orabdp",
    "subreddit": "legaladvicecanada",
    "title": "Friend Injured at Work Due to Third-Party Negligence",
    "author": "AvocadoPlastic1087",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orabdp/friend_injured_at_work_due_to_thirdparty/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-07T23:50:34.000Z",
    "text": "Hello everyone,\n\nI’m posting on behalf of a close friend who is very nervous about speaking up or taking legal action regarding a work injury. She was injured at her workplace due to a third-party company’s negligence. They failed to properly secure a work area, which led to an accident that caused serious and lasting injuries to her neck and shoulder.\n\nShe’s wondering if she can take legal action or file a separate claim against the third-party company for additional compensation, benefits, or ",
    "keyword": "workers compensation"
  },
  {
    "id": "1oste86",
    "subreddit": "legaladvicecanada",
    "title": "Career Nanny Writing Employment Contract",
    "author": "KnoxThingsOver",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oste86/career_nanny_writing_employment_contract/",
    "score": 0,
    "comments": 7,
    "created": "2025-11-09T20:11:22.000Z",
    "text": "Hello all,\n\nI am a self employed career nanny who was recently made aware that having a contract is pretty standard. I found a template online, but I'm a little confused. \n\nWhat does this mean in practical terms? *\"Except to the extent paid in settlement from any applicable insurance policies, and to the extent permitted by applicable law, each Party agrees to indemnify and hold harmless the other Party, and its respective affiliates, officers, agents, employees, and permitted successors and ass",
    "keyword": "workers compensation"
  },
  {
    "id": "1ooom70",
    "subreddit": "legaladvicecanada",
    "title": "Liability waiver after medical leave",
    "author": "Zestyclose_Rush_6823",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ooom70/liability_waiver_after_medical_leave/",
    "score": 0,
    "comments": 3,
    "created": "2025-11-05T00:39:25.000Z",
    "text": "Looking for advice on the legality of this or whether this is a normal thing and what the actual repercussions could be on this.\n\nSo i screwed up a couple ligaments in my wrist snowboarding in April. I work in construction and need my wrist, so have beej off on medical EI since then. Waiting for a surgical consultation still, but with physio and rest its gotten to the point i can go back to work, my doctor had cleared me, the pre-surgical consultation to see if i should have a surgical consultat",
    "keyword": "workers compensation"
  },
  {
    "id": "1onbrz7",
    "subreddit": "legaladvicecanada",
    "title": "Child support for disabled daughter after primary parent dies",
    "author": "marcalinevmpq",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onbrz7/child_support_for_disabled_daughter_after_primary/",
    "score": 43,
    "comments": 24,
    "created": "2025-11-03T13:29:48.000Z",
    "text": "\nThis is an emotional topic for me, so I have tried my best to remove any emotion and stick to the facts. \n\n\nmy sibling is an adult with permanent disabilities living in a publicly funded group living home in Ontario and our parents are divorced. our dad has tried to skirt his support obligations multiple times.\n\nour mother recently died and before her death my parents reached an agreement where our dad was only required to pay support in the amount of my sisters expenses since she no longer res",
    "keyword": "disability support"
  },
  {
    "id": "1p07mjp",
    "subreddit": "legaladvicecanada",
    "title": "Lost and homeless",
    "author": "sarebearxoxo",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p07mjp/lost_and_homeless/",
    "score": 41,
    "comments": 42,
    "created": "2025-11-18T09:33:22.000Z",
    "text": "While I was away on vacation for the first time in many, many years, I got to enjoy some family time with my sister and niece. \n\nMy fiance of almost 5 years texted me and told me that he had changed the locks and that I need to collect my things when I get back. \n\nI was in shock, I tried to call but no answer. \n\nI had one week left in another province with my family and I couldn’t wrap my head around how he could do that to me.\n\nOver the years I have taken care of his elderly parents. Spending c",
    "keyword": "disability support"
  },
  {
    "id": "1onkmeq",
    "subreddit": "legaladvicecanada",
    "title": "Trying to get Justice, only getting barricades, looking for guidance",
    "author": "Siletrea",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onkmeq/trying_to_get_justice_only_getting_barricades/",
    "score": 0,
    "comments": 9,
    "created": "2025-11-03T19:00:52.000Z",
    "text": "On behalf of my Gramma I tried to be the pacifist and hold off on pursuing legal aide and help to go after my Abusive spawn point of origin, who used and exploited me in SEVERAL ways while I was living with her.\n\n**Wage Theft**: I was the only employee in a \"family run\" dollarstore for 4 and a half years, worked 7 hours a day 6 days a week, including birthdays and minor holidays with no pay OR any breaks for lunch or to relieve myself. I worked 90% of the positions for the store where the only t",
    "keyword": "disability support"
  },
  {
    "id": "1paz3mm",
    "subreddit": "legaladvicecanada",
    "title": "Underemployed and child support",
    "author": "RDMercerJunior",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1paz3mm/underemployed_and_child_support/",
    "score": 3,
    "comments": 3,
    "created": "2025-12-01T01:06:27.000Z",
    "text": "Sole guardian here, since three years.\n\nMy former spouse has claimed in court they have no education, gave up multiple opportunities to support me in my education and career instead.\n\nIn actual fact, ex spouse has multiple degrees and has worked on mega projects in positions of real responsibility. But ex spouse likes to drink, you see, and wants to be taken care of.\n\nEx spouse was also enrolled in a PhD program to the point of being a PhD candidate until recently, and another diploma program, w",
    "keyword": "disability support"
  },
  {
    "id": "1p126w0",
    "subreddit": "legaladvicecanada",
    "title": "Complaint Respecting a Co-guardian or trustee application",
    "author": "EmmyA1fred",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p126w0/complaint_respecting_a_coguardian_or_trustee/",
    "score": 0,
    "comments": 3,
    "created": "2025-11-19T08:33:41.000Z",
    "text": "Has anyone successfully completed filing &amp; won the “ Complaint Respecting a Co-decision- Maker, Guardian or Trustee” form in Calgary, Alberta King’s Bench (surrogate matter)  against a family member “ Parents” for Guardianship &amp; Trustee of an Adult sibling with severe physical and mental disability? \n\n The reason for filing the complaint is to challenge my “ mother’s “ aka guardianship of my older brother who is 40 years old this January has/ is being neglected “isolation” and not having",
    "keyword": "disability support"
  },
  {
    "id": "1oqi8i6",
    "subreddit": "legaladvicecanada",
    "title": "Abusive Trustee Help Finding Legal Funding Support",
    "author": "HiddenLittleKitten",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oqi8i6/abusive_trustee_help_finding_legal_funding_support/",
    "score": 0,
    "comments": 3,
    "created": "2025-11-07T02:13:28.000Z",
    "text": "Hi, I'm physically disabled and was living with my Dad before he passed away as a disabled financial dependant, I'm currently living in his home that's in my Dad's estate's name and everything I was meant to live on and my medical needs was what my Dad had left behind for me as his only daughter \n\nMy Dad left behind a very dangerous will that has dangerous conflicts of interest against me where my Dad's older brother is the Executor, Trustee, and successor beneficiary that gets everything if I d",
    "keyword": "disability support"
  },
  {
    "id": "1pai9fx",
    "subreddit": "legaladvicecanada",
    "title": "WSIB Redetermination?",
    "author": "Fancy_Chain1651",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1pai9fx/wsib_redetermination/",
    "score": 1,
    "comments": 5,
    "created": "2025-11-30T13:26:46.000Z",
    "text": "Hello, I suffered a L1 burst fracture of my lumbar spine when I was 33 at work in 1999. WSIB NEL ( non economic loss)  ended up at 41%, with back and ptsd added together. I am now 59 and I have suffered another fracture now in my thoracic spine at the T10 vertebra . This is a result of low bone mass in spine from years on no weight bearing exertion from pain and the biomechanics changes in my spine from the initial L1 injury. I cannot do any yard work or other work on my house as a result of my ",
    "keyword": "WSIB"
  },
  {
    "id": "1oy3p5e",
    "subreddit": "legaladvicecanada",
    "title": "Telus employee fell in my yard",
    "author": "TeaEmber",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oy3p5e/telus_employee_fell_in_my_yard/",
    "score": 278,
    "comments": 91,
    "created": "2025-11-15T21:39:09.000Z",
    "text": "A Telus employee came to my door and said they had to gain access to my yard to go up a pole in my yard (for some random customers ticket, not ours). This isn’t unusual, they asked if they could go in my yard through my gate and I said yes. For what it’s worth I do have cameras in the front, side and back that are motion activated and have video of them asking for permission. 7 minutes later they fell off their ladder and they called 911 which we only realized when our notifications went crazy o",
    "keyword": "WSIB"
  },
  {
    "id": "1orvbgg",
    "subreddit": "legaladvicecanada",
    "title": "Denied extended maternity benefits - Ontario",
    "author": "bigfatgoalie_monica",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orvbgg/denied_extended_maternity_benefits_ontario/",
    "score": 17,
    "comments": 39,
    "created": "2025-11-08T17:34:20.000Z",
    "text": "Location: Ontario Canada\n\nMyself and 3 other female employees at my work have just started maternity leave.\n\nOur current collective agreement allows 18 weeks of top up pay while on maternity leave.\n\nWe are entering a new collective agreement as of January 1, in which maternity top up benefits are extended for 40 weeks.\n\nOur association is stating that the small group of pregnant/new moms who are on leave will NOT be entitled to the terms of the new agreement and will only get the 18 weeks that t",
    "keyword": "WSIB"
  },
  {
    "id": "1ozv8wj",
    "subreddit": "legaladvicecanada",
    "title": "Got laid off right after I told my work I was ready to come back after sick leave",
    "author": "HenriettaSyndrome",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ozv8wj/got_laid_off_right_after_i_told_my_work_i_was/",
    "score": 11,
    "comments": 21,
    "created": "2025-11-17T22:56:59.000Z",
    "text": "Had to go on sick leave after hurting my back at work..(CT warewhouse) was on it for the full 6 months and got a doctors note saying I could go back. \n\nMy back isn't actually all the way better, still have sciatica but ei ran out so I felt I had no choice.\n\nAnyway, they left me hanging for a few weeks after I told them I was ready to come back then my manager messaged me today saying I was being laid off and that my ROE was already sent for my sick leave. \n\nSo basically I got laid off immediatel",
    "keyword": "WSIB"
  },
  {
    "id": "1pbco0b",
    "subreddit": "legaladvicecanada",
    "title": "Double knee surgery",
    "author": "AdWild1071",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1pbco0b/double_knee_surgery/",
    "score": 6,
    "comments": 9,
    "created": "2025-12-01T13:23:42.000Z",
    "text": "Recently had double knee surgery, surgeon had specifically crossed all my limitations off stating I am not able to literally do anything and should not return to work at this time. I sorted it out with WSIB they talked to my employer that I should be good until my next reassessment with my surgeon for updated paper work. My immediate supervisor although even with all that above has said they will keep calling/messaging everyday asking if I am good to come back to work, is this okay/normal? ",
    "keyword": "WSIB"
  },
  {
    "id": "1onyrri",
    "subreddit": "legaladvicecanada",
    "title": "Injured myself at workplace",
    "author": "OwnConsideration4548",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onyrri/injured_myself_at_workplace/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-04T05:00:44.000Z",
    "text": "I filed for WSIB because my foot got fractured. I have spent $2500 on treatment as I do not have OHIP card and I am on my work permit. Its been 10 days since I am not going to work\n\nWill I get anything?\n\nMy employer comes under wsib But wsib’s reviews are very negative so i am scared",
    "keyword": "WSIB"
  },
  {
    "id": "1ow9sh0",
    "subreddit": "legaladvicecanada",
    "title": "Off work temporarily due to serious back pain. What are my options? Ontario.",
    "author": "prettygoodprettyneat",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ow9sh0/off_work_temporarily_due_to_serious_back_pain/",
    "score": 0,
    "comments": 6,
    "created": "2025-11-13T19:03:34.000Z",
    "text": "I’ve been off work for the last week due to some major back pain. It is not due to a specific incident just over worked, muscle imbalance and flexibility issues. My employer (construction industry) is fine with this. He said stay home, heal up, we need you back at 100% as soon as possible. I’m hoping I can return early next week. I’ve been seeing physio, chiropractor everyday. Had an X Ray. I could definitely get some kind of formal documentation stating my condition from a medical professional.",
    "keyword": "WSIB"
  },
  {
    "id": "1pcswhm",
    "subreddit": "legaladvicecanada",
    "title": "I live under a nightmare neighbour and no one will help me. I just need to vent.",
    "author": "Necessary-Hamster365",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1pcswhm/i_live_under_a_nightmare_neighbour_and_no_one/",
    "score": 87,
    "comments": 44,
    "created": "2025-12-03T03:02:25.000Z",
    "text": "I’ve lived in my apartment for 15 years. A woman moved in above me about four years ago, and since May of this year my life has turned into complete hell.\n\nShe has a dog, and all day.. every day.. she bounces a ball, drops hard toys on the floor, stomps, walks heavily, and shakes my ceiling. It’s not occasional noise. It’s constant and it’s loud enough that I can’t watch a movie, read, relax, or have friends over. I dread being in my own home.\n\nI’ve gone to my superintendent eight separate times",
    "keyword": "ODSP"
  },
  {
    "id": "1onbrz7",
    "subreddit": "legaladvicecanada",
    "title": "Child support for disabled daughter after primary parent dies",
    "author": "marcalinevmpq",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1onbrz7/child_support_for_disabled_daughter_after_primary/",
    "score": 39,
    "comments": 24,
    "created": "2025-11-03T13:29:48.000Z",
    "text": "\nThis is an emotional topic for me, so I have tried my best to remove any emotion and stick to the facts. \n\n\nmy sibling is an adult with permanent disabilities living in a publicly funded group living home in Ontario and our parents are divorced. our dad has tried to skirt his support obligations multiple times.\n\nour mother recently died and before her death my parents reached an agreement where our dad was only required to pay support in the amount of my sisters expenses since she no longer res",
    "keyword": "ODSP"
  },
  {
    "id": "1p6mqcu",
    "subreddit": "legaladvicecanada",
    "title": "How to Ensure the Evidence is Valid When Fighting a Denied Claim by WorkSafeBC?",
    "author": "Dunkelheit49",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p6mqcu/how_to_ensure_the_evidence_is_valid_when_fighting/",
    "score": 1,
    "comments": 4,
    "created": "2025-11-25T19:59:15.000Z",
    "text": "My injury claim was denied by WorkSafeBC. They canceled the post-injury exam, and I suspect this was done deliberately to prevent any new evidence that might change the outcome of my case since I applied for a review and I can upload new evidence since then.\n\nTheir medical advisor has contacted my family doctor multiple times, stating things like, \"*We don’t accept the diagnosis provided by you*,\" and so on.\n\nAs I’ve initiated a case review with the Review Division, and I’ve recently heard a the",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1p48jyg",
    "subreddit": "legaladvicecanada",
    "title": "Does medical evidence from another province count within BC? Trying to challenge a wrong decision made by WorkSafeBC.",
    "author": "Dunkelheit49",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p48jyg/does_medical_evidence_from_another_province_count/",
    "score": 0,
    "comments": 11,
    "created": "2025-11-23T00:19:11.000Z",
    "text": "I'm trying to help a friend who is suffering from concussion symptoms caused by a work injury. His concussion claim was denied by WorkSafeBC. Interestingly, the clinic associated with WorkSafeBC was reluctant to conduct the necessary concussion tests, such as a CT scan.\n\nI wonder if I can help him get these tests done sooner in Alberta or Ontario to prove that the decision was wrong, in order to support his request for a review and secure the compensation he deserves.",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1p490dh",
    "subreddit": "legaladvicecanada",
    "title": "Denial of Assistance by the Workers' Advisers Office (WAO)",
    "author": "SeaLover77777",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p490dh/denial_of_assistance_by_the_workers_advisers/",
    "score": 0,
    "comments": 6,
    "created": "2025-11-23T00:40:33.000Z",
    "text": "I am writing to ask advice about the procedural issues encountered with my harassment claim filed with WorkSafeBC and the subsequent refusal of my case by the Workers' Advisers Office (WAO).\n\n1. **Initial Claim with WorkSafeBC:** I filed a claim for workplace harassment experienced as a public service employee. During the adjudication process, the senior adjudicator assigned to my case significantly altered my testimony in their report. This included fabricating statements I never made and omitt",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1ox5v56",
    "subreddit": "legaladvicecanada",
    "title": "How to Pull Security Camera Footage?",
    "author": "Dunkelheit49",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ox5v56/how_to_pull_security_camera_footage/",
    "score": 0,
    "comments": 4,
    "created": "2025-11-14T19:21:56.000Z",
    "text": "I’m asking for a friend. We're in BC.  \nHe was recently injured at work, sustaining a head injury. The trauma from this injury made it impossible for him to continue working. He filed a claim with WorkSafeBC, which was initially accepted a few weeks ago.\n\nAfter several weeks of medical, physical, and psychological treatments, WorkSafeBC sent someone to retrieve the security footage from the scene (it’s a loading dock). \n\nHowever, their medical advisor and case officer later denied his claim and ",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1p5m1x6",
    "subreddit": "legaladvicecanada",
    "title": "[Canada] Friend’s Employer Cancelled Their Pre-Approved Vacation, Forcing In-Office Return Despite Psychological Injury, WCB Involvement, and No Medical Clearance — Looking for Advice",
    "author": "Lower_Lie2128",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p5m1x6/canada_friends_employer_cancelled_their/",
    "score": 0,
    "comments": 4,
    "created": "2025-11-24T16:45:11.000Z",
    "text": "**TL;DR**\n\nMy friend went on medical leave for a psychological injury caused by a supervisor. Their therapist has *not* cleared them to return to the office, and WCB scheduled a medical assessment for after the employer’s planned return date. Despite this, HR cancelled their pre-approved vacation without telling them (causing financial issues and travel conflicts), reduced their vacation balance with no explanation, and is now insisting they return to the office before the medical assessment and",
    "keyword": "WCB Alberta"
  },
  {
    "id": "1oq998l",
    "subreddit": "legaladvicecanada",
    "title": "CNESST: Worker's claim, hide names?",
    "author": "Due_Palpitation_3534",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oq998l/cnesst_workers_claim_hide_names/",
    "score": 1,
    "comments": 3,
    "created": "2025-11-06T20:01:26.000Z",
    "text": "Hello,\n\nI'm currently working on the chronology of events for my worker's claim with CNESST. It's currently upwards of 20 events and 40 pages with proofs attached, there's more than 30 relevant people mentioned. My friend just told me I can't use people's real names and should instead use \"Colleague A\" or \"Supervisor B\" as names because the employer will receive a copy of it. Is that a must-do or better practice or it does not really matter? The employer is already aware or responsible by action",
    "keyword": "CNESST"
  },
  {
    "id": "1oras6w",
    "subreddit": "legaladvicecanada",
    "title": "Local animal shelter is threatening legal action against me. What are my right?",
    "author": "DrunkenSeaBass",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oras6w/local_animal_shelter_is_threatening_legal_action/",
    "score": 91,
    "comments": 64,
    "created": "2025-11-08T00:10:49.000Z",
    "text": "I'll try to make it as short as I can. I was just made aware of it 2 hours ago. \n\nGirlfriend worked for a cat shelter. A kitten without a mom at around 6 week old came in. It requiered constant care so we boarded the cat in our home as volunteer. A few week go by and of course we got attached. Meanwhile, the shelter gave a new work contract to my girlfriend with a 10% salary reduction and a new schedule that was way worst. From her point of view its a retalation, becaused she worked overtime the",
    "keyword": "CNESST"
  },
  {
    "id": "1opd1p5",
    "subreddit": "legaladvicecanada",
    "title": "Grounds for wrongful termination ?",
    "author": "Effective-Stuff6136",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1opd1p5/grounds_for_wrongful_termination/",
    "score": 0,
    "comments": 14,
    "created": "2025-11-05T19:45:58.000Z",
    "text": "I will try to keep it simple. I am currently working in Montreal, on a Quebec permanent contract for our canadian branch (which is legally registered here).\n\nHead Firm is French, my manager is employed at the French headquarter so she is technically working for another company. Team is 6 people : 5 people in France on French contracts, and me, in Montreal, on a Canadian contract.\n\nJust received a termination notice on the grounds of a team restructuration due to economical difficulties. Problem ",
    "keyword": "CNESST"
  },
  {
    "id": "1on4xo3",
    "subreddit": "legaladvicecanada",
    "title": "Gtting fired after medical leave",
    "author": "Advanced_Pie_8165",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1on4xo3/gtting_fired_after_medical_leave/",
    "score": 9,
    "comments": 11,
    "created": "2025-11-03T06:50:25.000Z",
    "text": "I work for a large corporation in Canada. My doctor wants me to go on leave for 8 weeks to get treatment for a medical issue. However, when I started this job during onboarding, my manager told me that if I ever were to use the medical leave I would lose my job after. \n\nI didn't know if they were warning me that this is something the company does or this is their own personal belief and not something that HR would actually do. \n\nEither way, not a lot of use for me going on medical leave if I'm g",
    "keyword": "CNESST"
  },
  {
    "id": "1pdk7nc",
    "subreddit": "legaladvicecanada",
    "title": "Employer skilled hours out of my pay",
    "author": "Bsthelmic",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1pdk7nc/employer_skilled_hours_out_of_my_pay/",
    "score": 0,
    "comments": 4,
    "created": "2025-12-03T23:33:58.000Z",
    "text": "My employer skimmed total of 45hrs out of my pay. \nWhen confronted they gaslit me  ( they literally hinted as it being paid in front ) and started treating me even worse. \nThey added the hours to my last pay check slip and the amount still came out short according to my calculations. They said since I got paid more , I get less !! But it was like 200 less than my calculations. Refused to put them in their original slips and redo everything and refused to put them in their own pay check slip. And",
    "keyword": "CNESST"
  },
  {
    "id": "1ozfqh5",
    "subreddit": "legaladvicecanada",
    "title": "Recourse for pregnant worker",
    "author": "nini_xoxox",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ozfqh5/recourse_for_pregnant_worker/",
    "score": 0,
    "comments": 6,
    "created": "2025-11-17T13:04:44.000Z",
    "text": "Hello!\n\nI’m 19 years old and I just found out that I’m pregnant. My boss did everything to push me to resign (verbal harassment, judgment, reduction of hours, etc.)\n\nAside from filing a complaint with the CNESST, what other recourse am I entitled to?\n\nI’m a hairdresser and i live in quebec\n",
    "keyword": "CNESST"
  },
  {
    "id": "1opcws8",
    "subreddit": "legaladvicecanada",
    "title": "Is there ground for a wrongful termination in my case ?",
    "author": "Tirkam",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1opcws8/is_there_ground_for_a_wrongful_termination_in_my/",
    "score": 1,
    "comments": 2,
    "created": "2025-11-05T19:40:59.000Z",
    "text": "Hi everyone.\n\nI will try to keep it simple. I am currently working in Montreal, on a Quebec permanent contract for our canadian branch (which is legally registered here).\n\nHead Firm is French, my manager is employed at the French headquarter so she is technically working for another company. Team is 6 people : 5 people in France on French contracts, and me, in Montreal, on a Canadian contract.\n\nJust received a termination notice on the grounds of a team restructuration due to economical difficul",
    "keyword": "CNESST"
  },
  {
    "id": "1oon0ki",
    "subreddit": "legaladvicecanada",
    "title": "Holiday Pay Quebec",
    "author": "Ecstatic-Plane7834",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oon0ki/holiday_pay_quebec/",
    "score": 0,
    "comments": 2,
    "created": "2025-11-04T23:30:04.000Z",
    "text": "Hello! \nI have tried to find some kind of information about this online but I am having a lot of trouble with it. \n\nI have recently gotten a promotion at work and now am a salaried employee. \n\nUnfortunately, after a last minute schedule change without my approval, I am scheduled to work December 25-26 and January 1st. I have talked with HR and they told me to request those days off because I do not get holiday pay for working those days. Now I have recieved an email stating that my requests are ",
    "keyword": "CNESST"
  },
  {
    "id": "1p5m1x6",
    "subreddit": "legaladvicecanada",
    "title": "[Canada] Friend’s Employer Cancelled Their Pre-Approved Vacation, Forcing In-Office Return Despite Psychological Injury, WCB Involvement, and No Medical Clearance — Looking for Advice",
    "author": "Lower_Lie2128",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p5m1x6/canada_friends_employer_cancelled_their/",
    "score": 0,
    "comments": 4,
    "created": "2025-11-24T16:45:11.000Z",
    "text": "**TL;DR**\n\nMy friend went on medical leave for a psychological injury caused by a supervisor. Their therapist has *not* cleared them to return to the office, and WCB scheduled a medical assessment for after the employer’s planned return date. Despite this, HR cancelled their pre-approved vacation without telling them (causing financial issues and travel conflicts), reduced their vacation balance with no explanation, and is now insisting they return to the office before the medical assessment and",
    "keyword": "WCB"
  },
  {
    "id": "1orabdp",
    "subreddit": "legaladvicecanada",
    "title": "Friend Injured at Work Due to Third-Party Negligence",
    "author": "AvocadoPlastic1087",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1orabdp/friend_injured_at_work_due_to_thirdparty/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-07T23:50:34.000Z",
    "text": "Hello everyone,\n\nI’m posting on behalf of a close friend who is very nervous about speaking up or taking legal action regarding a work injury. She was injured at her workplace due to a third-party company’s negligence. They failed to properly secure a work area, which led to an accident that caused serious and lasting injuries to her neck and shoulder.\n\nShe’s wondering if she can take legal action or file a separate claim against the third-party company for additional compensation, benefits, or ",
    "keyword": "WCB"
  },
  {
    "id": "1ooom70",
    "subreddit": "legaladvicecanada",
    "title": "Liability waiver after medical leave",
    "author": "Zestyclose_Rush_6823",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ooom70/liability_waiver_after_medical_leave/",
    "score": 0,
    "comments": 3,
    "created": "2025-11-05T00:39:25.000Z",
    "text": "Looking for advice on the legality of this or whether this is a normal thing and what the actual repercussions could be on this.\n\nSo i screwed up a couple ligaments in my wrist snowboarding in April. I work in construction and need my wrist, so have beej off on medical EI since then. Waiting for a surgical consultation still, but with physio and rest its gotten to the point i can go back to work, my doctor had cleared me, the pre-surgical consultation to see if i should have a surgical consultat",
    "keyword": "WCB"
  },
  {
    "id": "1p48jyg",
    "subreddit": "legaladvicecanada",
    "title": "Does medical evidence from another province count within BC? Trying to challenge a wrong decision made by WorkSafeBC.",
    "author": "Dunkelheit49",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p48jyg/does_medical_evidence_from_another_province_count/",
    "score": 0,
    "comments": 11,
    "created": "2025-11-23T00:19:11.000Z",
    "text": "I'm trying to help a friend who is suffering from concussion symptoms caused by a work injury. His concussion claim was denied by WorkSafeBC. Interestingly, the clinic associated with WorkSafeBC was reluctant to conduct the necessary concussion tests, such as a CT scan.\n\nI wonder if I can help him get these tests done sooner in Alberta or Ontario to prove that the decision was wrong, in order to support his request for a review and secure the compensation he deserves.",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p6mqcu",
    "subreddit": "legaladvicecanada",
    "title": "How to Ensure the Evidence is Valid When Fighting a Denied Claim by WorkSafeBC?",
    "author": "Dunkelheit49",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p6mqcu/how_to_ensure_the_evidence_is_valid_when_fighting/",
    "score": 1,
    "comments": 4,
    "created": "2025-11-25T19:59:15.000Z",
    "text": "My injury claim was denied by WorkSafeBC. They canceled the post-injury exam, and I suspect this was done deliberately to prevent any new evidence that might change the outcome of my case since I applied for a review and I can upload new evidence since then.\n\nTheir medical advisor has contacted my family doctor multiple times, stating things like, \"*We don’t accept the diagnosis provided by you*,\" and so on.\n\nAs I’ve initiated a case review with the Review Division, and I’ve recently heard a the",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ossb7u",
    "subreddit": "legaladvicecanada",
    "title": "Stopped by police for speeding, charged with not having insurance for future policy despite current policy being active.",
    "author": "Interesting_Way8917",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ossb7u/stopped_by_police_for_speeding_charged_with_not/",
    "score": 160,
    "comments": 201,
    "created": "2025-11-09T19:29:25.000Z",
    "text": "Hello everyone,\n\nI was pulled over yesterday night for allegedly speeding on the highway coming home from work around 3:30am. I was told the reason I was pulled over was for speeding 20KM over. Cop asked me where I was coming from and why I'm in a hurry. I told him I was coming from work, asked where I worked, told him I worked in nightlife, asked if I had any drinks (answered no). I drive a range rover, the windows are tinted (legally), cop asked for license and registration and if I own the ca",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p59kmd",
    "subreddit": "legaladvicecanada",
    "title": "Got into my first car accident, police said “I was at fault”",
    "author": "Miserable-Office-476",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p59kmd/got_into_my_first_car_accident_police_said_i_was/",
    "score": 119,
    "comments": 145,
    "created": "2025-11-24T06:14:26.000Z",
    "text": "Got into my first car accident today. I was making a left turn and another car hit the passenger side of my car. Only the passenger side of my bumper came off. The officer said I’m at fault because I should’ve made a “better judgment” on whether it was safe to turn. He gave me a $120 ticket with no demerit points.\n\nI’m 18 and on my dad’s insurance, and I’m kinda confused about how this works. Since the accident was dealt with on-site by police, we didn’t exchange info with the other driver — eve",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p3bqz0",
    "subreddit": "legaladvicecanada",
    "title": "Can my Toronto boutique condo legally block me from moving out if they won’t let me use the elevator or stairs?",
    "author": "Separate-Scene4672",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p3bqz0/can_my_toronto_boutique_condo_legally_block_me/",
    "score": 319,
    "comments": 62,
    "created": "2025-11-21T22:02:05.000Z",
    "text": "I live in a boutique condo in Toronto with two elevators: one is usually for moving/freight and one is for regular use. The “moving” elevator has been out of service for about two weeks (and was also down a few months ago). My lease ends Dec 1 and I gave notice to my landlord about three months ago, and I plan to move out on Nov 30. Building management just told me I’m not allowed to use the working passenger elevator or the stairs to move my stuff, which basically leaves me with no way to move ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ozv8wj",
    "subreddit": "legaladvicecanada",
    "title": "Got laid off right after I told my work I was ready to come back after sick leave",
    "author": "HenriettaSyndrome",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ozv8wj/got_laid_off_right_after_i_told_my_work_i_was/",
    "score": 11,
    "comments": 21,
    "created": "2025-11-17T22:56:59.000Z",
    "text": "Had to go on sick leave after hurting my back at work..(CT warewhouse) was on it for the full 6 months and got a doctors note saying I could go back. \n\nMy back isn't actually all the way better, still have sciatica but ei ran out so I felt I had no choice.\n\nAnyway, they left me hanging for a few weeks after I told them I was ready to come back then my manager messaged me today saying I was being laid off and that my ROE was already sent for my sick leave. \n\nSo basically I got laid off immediatel",
    "keyword": "WorkSafe"
  },
  {
    "id": "1oyxdkb",
    "subreddit": "legaladvicecanada",
    "title": "My friend wanna move out but their parents won’t let them",
    "author": "No-Understanding2459",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1oyxdkb/my_friend_wanna_move_out_but_their_parents_wont/",
    "score": 0,
    "comments": 18,
    "created": "2025-11-16T21:14:16.000Z",
    "text": "I’m 20f  me and 2 friends ( 20 non binary and 19male) are planning to move out of our parents and move to a different city next year the problem is my non binary friend they wanna move out but there parents refuse to because there mom and dad can barley live by and they both working. They also work for there mom but being underpaid at the daycare…..me and my male friend offer to pay their half until the contract is over then help them finding a better job but my nb friends parents refuse to \n\nSo",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p1p2kp",
    "subreddit": "legaladvicecanada",
    "title": "Without cause",
    "author": "HoneydewMore2985",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p1p2kp/without_cause/",
    "score": 1,
    "comments": 16,
    "created": "2025-11-20T00:38:38.000Z",
    "text": "I got poached by a former boss to come work with him at a dealership.. at first I thought it would be a great idea since I already had a professional relationship with him. We had agreed on terms and everything seemed fine but as employees got more comfortable with me as a GSM they kept telling me how useless he was... I felt obligated to try to fix things and get this dealership back on top, unfortunately after many attempts to create process I never got the support I required I felt defeated a",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ozh6ll",
    "subreddit": "legaladvicecanada",
    "title": "Is it safe for me to discuss my job with a research company?",
    "author": "GrandBill",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1ozh6ll/is_it_safe_for_me_to_discuss_my_job_with_a/",
    "score": 0,
    "comments": 10,
    "created": "2025-11-17T14:06:42.000Z",
    "text": "Please excuse if I'm naive but I have a lower-level job and this is new to me. \n\nI was contacted by a research company who wants to pay me to ask me questions about my work.  I don't want to ask my boss because I assume he'll take the easy route and just tell me 'no'.  I also don't plan to talk about anything concerning my company, but that's a fine line if I'm to talk about what I know because it all comes from my job.  Is this a safe thing for me to do?  ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p4h30h",
    "subreddit": "legaladvicecanada",
    "title": "Slip and Fall injury questions",
    "author": "Jennybee8",
    "url": "https://reddit.com/r/legaladvicecanada/comments/1p4h30h/slip_and_fall_injury_questions/",
    "score": 0,
    "comments": 9,
    "created": "2025-11-23T07:56:16.000Z",
    "text": "While away for a weekend at a small Ontario resort, I slipped and fell, badly bruising my thigh and tearing several muscles , the extensive pain from which is still unfolding 8 days later.\n\nI am already disabled with a chronic pain condition and I fear that this accident (although nothing is broken) is going to affect my wellbeing for years to come. \n\nI reported the incident, which happened on the small deck area at the entrance to our rented chalet, to the resort. They just said sorry but did n",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p35vli",
    "subreddit": "britishcolumbia",
    "title": "Autism services and care",
    "author": "Nervous_Pineapple697",
    "url": "https://reddit.com/r/britishcolumbia/comments/1p35vli/autism_services_and_care/",
    "score": 10,
    "comments": 44,
    "created": "2025-11-21T18:11:08.000Z",
    "text": "Hello Canada! I’m curious as to how the care and support services are for autistic and mentally disabled people in Canada. Particularly Vancouver BC area. How are the support services like OT, Reimbursement for babysitters, diapers and school programs? \n\nI have a lvl 2 autistic kiddo in my care. The harsh truth is my wife is barely 5 feet tall and he is going to get big and will probably eventually be too much for my family to handle safely. How are the live in facilities in the event we give up",
    "keyword": "disability support"
  },
  {
    "id": "1pc8xdi",
    "subreddit": "britishcolumbia",
    "title": "WorkSafe BC - Construction Industry Training",
    "author": "Easy_Goal7849",
    "url": "https://reddit.com/r/britishcolumbia/comments/1pc8xdi/worksafe_bc_construction_industry_training/",
    "score": 2,
    "comments": 3,
    "created": "2025-12-02T13:50:15.000Z",
    "text": "Are there any training courses that I can take online prior to arriving in BC that are directed to the construction industry?\n\nI come from a COR certified company in ON but I can’t tell I don’t think any of my training is valid in BC.",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1p515rp",
    "subreddit": "britishcolumbia",
    "title": "Physician considering BC",
    "author": "sankdafide",
    "url": "https://reddit.com/r/britishcolumbia/comments/1p515rp/physician_considering_bc/",
    "score": 276,
    "comments": 335,
    "created": "2025-11-23T23:18:36.000Z",
    "text": "I’m a physician and considering Victoria. I cannot do many days of gloomy low sunlight days. My googling and ChatGPT searches have been conflicting. I don’t really care about cost of living. I just want to be happy and safe and surrounded by kind like-minded people who value working to live and not living to work. Anyway, does Victoria get plenty of sun? I see &gt;2200 hours of sunlight hours a year, and that it’s in a rain shadow so unlikely to get us much cloud cover as surrounding areas. Any ",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1ovjff0",
    "subreddit": "britishcolumbia",
    "title": "Moving to BC from the UK",
    "author": "Honest-Necessary-124",
    "url": "https://reddit.com/r/britishcolumbia/comments/1ovjff0/moving_to_bc_from_the_uk/",
    "score": 0,
    "comments": 33,
    "created": "2025-11-12T22:18:25.000Z",
    "text": "Hi, I'm looking into moving to BC with my family, from the UK.  I currently have a fairly well paid job (over here), in the tech industry, as a cloud architect in financial services, and wondering what I should expect.\n\nWhat kind of neighbourhoods are safe places to raise a family, and situated where I would be able to get into downtown in reasonable time? I estimate that I could afford a house in the region of $1-1.2m.\n\nShould I expect to be hybrid working, or office based, or both?   Any help ",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1pdniqf",
    "subreddit": "britishcolumbia",
    "title": "Story: Hiked Josef Bay at night by accident, was surprised to see the supermoon. Type 2 fun.",
    "author": "Quarkjoy",
    "url": "https://reddit.com/r/britishcolumbia/comments/1pdniqf/story_hiked_josef_bay_at_night_by_accident_was/",
    "score": 36,
    "comments": 2,
    "created": "2025-12-04T02:00:51.000Z",
    "text": "I made a schedule for our trip up North knowing the sun sets early and wanting to be safe and have daylight. I looked at the tide chart. The high tide was 11:30, and the low tide was 18:00. I explained that while I really wanted to go during the low tide, it would happen well after sunset and therefore was off the table. I decided we ought to go after 11:30 to mitigate any worry of being trapped behind the rising tide.\n\nAll this planning was great, but I slept in on the day we were to go to the ",
    "keyword": "WorkSafeBC"
  },
  {
    "id": "1ophwgg",
    "subreddit": "britishcolumbia",
    "title": "WCB",
    "author": "WastingMyNameChance",
    "url": "https://reddit.com/r/britishcolumbia/comments/1ophwgg/wcb/",
    "score": 5,
    "comments": 3,
    "created": "2025-11-05T22:47:38.000Z",
    "text": "I'll keep this short and open ended so people can broadly share thier thoughts.\n\nWondering what people's experiences dealing with WCB and life after dealing with WCB when officially labeled 100% disabled.\n\nI \"ended\" my WCB process a few years ago and am happy to share but looking to hear from you aswell.\n\nCheers\n",
    "keyword": "WCB"
  },
  {
    "id": "1otp9gq",
    "subreddit": "britishcolumbia",
    "title": "B.C. fined $759K for safety violations in fatal, near-fatal wildfire incidents",
    "author": "oilbeefhooked",
    "url": "https://reddit.com/r/britishcolumbia/comments/1otp9gq/bc_fined_759k_for_safety_violations_in_fatal/",
    "score": 131,
    "comments": 9,
    "created": "2025-11-10T20:38:23.000Z",
    "text": "",
    "keyword": "WCB"
  },
  {
    "id": "1pc8xdi",
    "subreddit": "britishcolumbia",
    "title": "WorkSafe BC - Construction Industry Training",
    "author": "Easy_Goal7849",
    "url": "https://reddit.com/r/britishcolumbia/comments/1pc8xdi/worksafe_bc_construction_industry_training/",
    "score": 2,
    "comments": 3,
    "created": "2025-12-02T13:50:15.000Z",
    "text": "Are there any training courses that I can take online prior to arriving in BC that are directed to the construction industry?\n\nI come from a COR certified company in ON but I can’t tell I don’t think any of my training is valid in BC.",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p515rp",
    "subreddit": "britishcolumbia",
    "title": "Physician considering BC",
    "author": "sankdafide",
    "url": "https://reddit.com/r/britishcolumbia/comments/1p515rp/physician_considering_bc/",
    "score": 276,
    "comments": 335,
    "created": "2025-11-23T23:18:36.000Z",
    "text": "I’m a physician and considering Victoria. I cannot do many days of gloomy low sunlight days. My googling and ChatGPT searches have been conflicting. I don’t really care about cost of living. I just want to be happy and safe and surrounded by kind like-minded people who value working to live and not living to work. Anyway, does Victoria get plenty of sun? I see &gt;2200 hours of sunlight hours a year, and that it’s in a rain shadow so unlikely to get us much cloud cover as surrounding areas. Any ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p32r9t",
    "subreddit": "britishcolumbia",
    "title": "Man dead after mining incident in B.C.",
    "author": "oilbeefhooked",
    "url": "https://reddit.com/r/britishcolumbia/comments/1p32r9t/man_dead_after_mining_incident_in_bc/",
    "score": 244,
    "comments": 68,
    "created": "2025-11-21T16:13:51.000Z",
    "text": "",
    "keyword": "WorkSafe"
  },
  {
    "id": "1pbz51m",
    "subreddit": "britishcolumbia",
    "title": "New parents ask to leave St. Paul’s Hospital early over mice concerns.",
    "author": "Left-Science-1109",
    "url": "https://reddit.com/r/britishcolumbia/comments/1pbz51m/new_parents_ask_to_leave_st_pauls_hospital_early/",
    "score": 174,
    "comments": 60,
    "created": "2025-12-02T04:29:56.000Z",
    "text": "",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ovjff0",
    "subreddit": "britishcolumbia",
    "title": "Moving to BC from the UK",
    "author": "Honest-Necessary-124",
    "url": "https://reddit.com/r/britishcolumbia/comments/1ovjff0/moving_to_bc_from_the_uk/",
    "score": 0,
    "comments": 33,
    "created": "2025-11-12T22:18:25.000Z",
    "text": "Hi, I'm looking into moving to BC with my family, from the UK.  I currently have a fairly well paid job (over here), in the tech industry, as a cloud architect in financial services, and wondering what I should expect.\n\nWhat kind of neighbourhoods are safe places to raise a family, and situated where I would be able to get into downtown in reasonable time? I estimate that I could afford a house in the region of $1-1.2m.\n\nShould I expect to be hybrid working, or office based, or both?   Any help ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1oy5mjg",
    "subreddit": "britishcolumbia",
    "title": "After 3 Whale Deaths Off British Columbia, Researchers Fear a Pattern",
    "author": "SnooRegrets4312",
    "url": "https://reddit.com/r/britishcolumbia/comments/1oy5mjg/after_3_whale_deaths_off_british_columbia/",
    "score": 134,
    "comments": 12,
    "created": "2025-11-15T23:02:22.000Z",
    "text": "",
    "keyword": "WorkSafe"
  },
  {
    "id": "1pdniqf",
    "subreddit": "britishcolumbia",
    "title": "Story: Hiked Josef Bay at night by accident, was surprised to see the supermoon. Type 2 fun.",
    "author": "Quarkjoy",
    "url": "https://reddit.com/r/britishcolumbia/comments/1pdniqf/story_hiked_josef_bay_at_night_by_accident_was/",
    "score": 36,
    "comments": 2,
    "created": "2025-12-04T02:00:51.000Z",
    "text": "I made a schedule for our trip up North knowing the sun sets early and wanting to be safe and have daylight. I looked at the tide chart. The high tide was 11:30, and the low tide was 18:00. I explained that while I really wanted to go during the low tide, it would happen well after sunset and therefore was off the table. I decided we ought to go after 11:30 to mitigate any worry of being trapped behind the rising tide.\n\nAll this planning was great, but I slept in on the day we were to go to the ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ow2a3u",
    "subreddit": "vancouver",
    "title": "The 2025 /r/Vancouver Shop-Local Business Holiday Guide",
    "author": "Moggehh",
    "url": "https://reddit.com/r/vancouver/comments/1ow2a3u/the_2025_rvancouver_shoplocal_business_holiday/",
    "score": 76,
    "comments": 9,
    "created": "2025-11-13T14:19:41.000Z",
    "text": "Hey party people!\n\nWe're back for the newest iteration of the Shop Local Holiday Guide for people looking for gift ideas for the holiday season!\n\n* [2020 Shop Local Holiday List](https://www.reddit.com/r/vancouver/comments/jjdd9t/)    \n* [2021 Shop Local Holiday List](https://www.reddit.com/r/vancouver/comments/qfxtlw/)    \n* [2022 Shop Local Holiday List](https://www.reddit.com/r/vancouver/comments/ypyxs1/)    \n* [2023 Shop Local Holiday List](https://www.reddit.com/r/vancouver/comments/180ogno",
    "keyword": "disability support"
  },
  {
    "id": "1onqogm",
    "subreddit": "alberta",
    "title": "I asked my UCP MLA \"What made you think that violating the rights of the people you serve would be a good idea?\" and this was their response.",
    "author": "AzraelCcs",
    "url": "https://reddit.com/r/alberta/comments/1onqogm/i_asked_my_ucp_mla_what_made_you_think_that/",
    "score": 381,
    "comments": 358,
    "created": "2025-11-03T22:48:12.000Z",
    "text": "Thank you for sharing your concerns with me.  When it comes to Bill 2: the Back to School Act, we know many families, students, teachers, and school leaders are feeling the stress and uncertainty that comes with the ATA’s strike.\n\n \n\nThe last proposal put on the table by the ATA demanded an additional $2 billion from government (over and above the $2.6 billion agreement on the table). This offer by the ATA did not present a path to resolving this dispute. This also came after eighteen months of ",
    "keyword": "disability support"
  },
  {
    "id": "1opkrme",
    "subreddit": "alberta",
    "title": "Application submitted to recall Grande Prairie MLA : My Grande Prairie Now",
    "author": "Appropriate_Duty_930",
    "url": "https://reddit.com/r/alberta/comments/1opkrme/application_submitted_to_recall_grande_prairie/",
    "score": 388,
    "comments": 8,
    "created": "2025-11-06T00:47:48.000Z",
    "text": "",
    "keyword": "disability support"
  },
  {
    "id": "1oxz5b1",
    "subreddit": "alberta",
    "title": "Protest the UCP at their AGM (IV)",
    "author": "symbionica",
    "url": "https://reddit.com/r/alberta/comments/1oxz5b1/protest_the_ucp_at_their_agm_iv/",
    "score": 191,
    "comments": 21,
    "created": "2025-11-15T18:32:43.000Z",
    "text": "Hey everyone! \n\nIt's been a bit since I've posted an update but we have been busy! \n\nQuick recap: I've partnered with the Alberta Civic Integrity Project to plan a rally (the Rally of Resistance) for the weekend of November 28th - 30th. It will be at Borden Park, which is next to the Expo Centre where the UCP’s annual general meeting will be held that same weekend. Our goal is to peacefully rally and protest, while also building up our community of like-minded people. \n\nWe're protesting the UCP ",
    "keyword": "disability support"
  },
  {
    "id": "1ozi7rt",
    "subreddit": "alberta",
    "title": "Looking for alberta care giving supports?",
    "author": "dizmali_",
    "url": "https://reddit.com/r/alberta/comments/1ozi7rt/looking_for_alberta_care_giving_supports/",
    "score": 5,
    "comments": 8,
    "created": "2025-11-17T14:48:53.000Z",
    "text": "I've looked on the government of Canada and Alberta website and cant find it.My GF is stage 4 liver failure, she's waiting for a transplant, ive been taking care of her since the diagnosis. I cook her meals,  get the groceries( currently can only pay half of the groceries because im on disability. do her dishes I go to her doctor's appts, make sure she takes her medications, make sure she always has water/ something to drink, clean her clothes, clean/change the bed sheets, feed her cats etc etc ",
    "keyword": "disability support"
  },
  {
    "id": "1ox8lff",
    "subreddit": "alberta",
    "title": "WCB claim need help",
    "author": "Exciting-Location484",
    "url": "https://reddit.com/r/alberta/comments/1ox8lff/wcb_claim_need_help/",
    "score": 5,
    "comments": 9,
    "created": "2025-11-14T21:07:46.000Z",
    "text": "I was injured at work a couple weeks ago and WCB has approved my claim however the company that coordinates with my work and wcb (we have a wcb company that does the middle man job) has given false information regarding my duties and is completely slowing down the process as WCB doesn’t know who’s telling the true. I have given pay stubs and I’m just getting frustrated. \n\nBasically I work 12 hrs with overtime everyday for 21 days straight and have 7 days off a month. WCB has offered to top up my",
    "keyword": "WCB"
  },
  {
    "id": "1p1fnou",
    "subreddit": "alberta",
    "title": "As a trans person, I'm terrified and enraged",
    "author": "chronically-iconic06",
    "url": "https://reddit.com/r/alberta/comments/1p1fnou/as_a_trans_person_im_terrified_and_enraged/",
    "score": 1183,
    "comments": 314,
    "created": "2025-11-19T18:31:26.000Z",
    "text": "So, for anyone who might not know, yesterday the UCP officially used the non-withstanding clause to remove various rights from transgender youth.\n\nAs a trans person myself, I'm enraged. And I'm terrified.\n\nTrans people are already some of the most vulnerable people in the world; 41% of us die by suicide, and we are already 4 times MORE LIKELY to be victims of violent crime then the general population. Those numbers go *way up* when when we don't have access to gender affirming care.\n\nKids are go",
    "keyword": "WorkSafe"
  },
  {
    "id": "1onqogm",
    "subreddit": "alberta",
    "title": "I asked my UCP MLA \"What made you think that violating the rights of the people you serve would be a good idea?\" and this was their response.",
    "author": "AzraelCcs",
    "url": "https://reddit.com/r/alberta/comments/1onqogm/i_asked_my_ucp_mla_what_made_you_think_that/",
    "score": 384,
    "comments": 358,
    "created": "2025-11-03T22:48:12.000Z",
    "text": "Thank you for sharing your concerns with me.  When it comes to Bill 2: the Back to School Act, we know many families, students, teachers, and school leaders are feeling the stress and uncertainty that comes with the ATA’s strike.\n\n \n\nThe last proposal put on the table by the ATA demanded an additional $2 billion from government (over and above the $2.6 billion agreement on the table). This offer by the ATA did not present a path to resolving this dispute. This also came after eighteen months of ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ourhqy",
    "subreddit": "alberta",
    "title": "What options exist for a 16 year old wanting independent living?",
    "author": "Designer-Pen-3918",
    "url": "https://reddit.com/r/alberta/comments/1ourhqy/what_options_exist_for_a_16_year_old_wanting/",
    "score": 29,
    "comments": 61,
    "created": "2025-11-12T01:10:26.000Z",
    "text": "Hi everyone,\n\nI’m 15 and I’ve been thinking a lot about living on my own when I'm 16. I haven’t gotten my learner’s license yet, and I don’t have a job at the moment.\n\nMy current home environment isn’t safe for me to stay long-term, and I’m exploring options for living independently. I’ve heard that in some cases, Child and Family Services can help minors with housing and financial support, but I’m not sure how it works or what qualifies.\n\nI’m mainly trying to understand:\n\nWhat support options e",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p2ejgv",
    "subreddit": "Calgary",
    "title": "What does hospital do for migraines?",
    "author": "winnipeggremlin",
    "url": "https://reddit.com/r/Calgary/comments/1p2ejgv/what_does_hospital_do_for_migraines/",
    "score": 40,
    "comments": 74,
    "created": "2025-11-20T20:44:35.000Z",
    "text": "\nThose of you that have been, what does ER do for migraines?  Are there certain tests or imaging I should advocate for? Is there a certain ER that is better than others for neuro issues?\n\nHusband had a nerve block done late in October and after 2 weeks of relief his migraines have been non stop. He can't really eat or do anything. The poor guy can barely string together a sentence and his normal migraine meds are not making any help for this\n\nBeing on WCB most migraine clinics are turning him aw",
    "keyword": "WCB"
  },
  {
    "id": "1p5qqpw",
    "subreddit": "Calgary",
    "title": "The Snow and Pedestrians",
    "author": "unzinc",
    "url": "https://reddit.com/r/Calgary/comments/1p5qqpw/the_snow_and_pedestrians/",
    "score": 235,
    "comments": 110,
    "created": "2025-11-24T19:34:58.000Z",
    "text": "I wanted to bring this up as a safety note as I saw TWO separate rear end collisions happen on my way to work, both along Fourth Street. Both were caused by pedestrians running out and crossing the road while trying to beat the pedestrian crossing signal while the hand signal was flashing (indicating to finish crossing and to NOT START crossing). In the one collision, the car that got rear-ended was very close to sliding into and bumping the pedestrian.\n\nBe careful out there folks. Pedestrians n",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p8n0yj",
    "subreddit": "Calgary",
    "title": "FIND BRUNO",
    "author": "Guilty_46",
    "url": "https://reddit.com/r/Calgary/comments/1p8n0yj/find_bruno/",
    "score": 267,
    "comments": 13,
    "created": "2025-11-28T05:40:36.000Z",
    "text": "Keep things of this dog. Saw the poster and thought if share on here. \n\nThere facebook post copyed\n\nBruno is still missing in Calgary as of Nov 19th. The family is deeply missing him and hoping for his safe return. \n\nPlease Share, Repost, Search and help spread awareness so we can find little Bruno.\n\nIF YOU SEE HIM -- DON'T CHASE, FOLLOW OR CALL OUT TO HIM -- keep an eye on him while you Call 250-261-1979 or 587-834-4132. Specific details about sightings is really important.\n\nBruno has been miss",
    "keyword": "WorkSafe"
  },
  {
    "id": "1ovtf0v",
    "subreddit": "Calgary",
    "title": "Calgary Grocery Deals (November 13 - 19, 2025)",
    "author": "UncleNedisDead",
    "url": "https://reddit.com/r/Calgary/comments/1ovtf0v/calgary_grocery_deals_november_13_19_2025/",
    "score": 176,
    "comments": 11,
    "created": "2025-11-13T05:58:43.000Z",
    "text": "Happy Wednesday!\n\n\nThis is in honour of /u/PurpleGeek who usually combs the flyers for deals and posts it for us. They have not posted this week because they are traveling. (Safe travels PurpleGeek!) The next list will likely be posted on November 19, 2025.\n\nThere are probably additional items that are good deals but I don't know it because they aren't items I use but hopefully my list is still useful to you.\n\nA few quick reminders:\n\n* PC Optimum points are collected at No Frills and Superstore.",
    "keyword": "WorkSafe"
  },
  {
    "id": "1oumq7t",
    "subreddit": "Calgary",
    "title": "Tell Me About the Neighbourhood I May be About to Move Into",
    "author": "mydreamturnip",
    "url": "https://reddit.com/r/Calgary/comments/1oumq7t/tell_me_about_the_neighbourhood_i_may_be_about_to/",
    "score": 2,
    "comments": 21,
    "created": "2025-11-11T21:52:10.000Z",
    "text": "Hey all, new to the community. I'm going to be moving to Calgary from Saskatoon at the end of this month and I've found a place to live. Building is nice, apartment is nice. Just need to do a sanity check on the neighbourhood as a couple of my co-workers have given me a heads up about the surrounding area. Like literally, I told one of them today (a stat holiday) and she called me immediately to give me a heads up. \n\nThe place is in Beltline and is one block North of Sheldon Chumir Health Center",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p61ftz",
    "subreddit": "Edmonton",
    "title": "Parent Engagement Activities",
    "author": "No_fame07",
    "url": "https://reddit.com/r/Edmonton/comments/1p61ftz/parent_engagement_activities/",
    "score": 0,
    "comments": 7,
    "created": "2025-11-25T03:00:57.000Z",
    "text": "My child goes to an elementary school here in Edmonton. We are looking to host a parent engagement activity; something along the lines of a child/youth + parenting mental health &amp; wellness workshop/seminar. We would be hiring a person/group to come to our school in the evening to host it.\n\nI feel like I've searched every where including asking chatGPT for help and I'm not finding what I am looking for. \n\nI'd love *specific* ideas (links, program names etc.) that would be a good fit under tha",
    "keyword": "WCB"
  },
  {
    "id": "1p3bm2j",
    "subreddit": "Edmonton",
    "title": "Seeking Guidance: 20, M, and Hoping to Leave My Hutterite Colony and Start Fresh in Edmonton",
    "author": "kaleb_jh0f",
    "url": "https://reddit.com/r/Edmonton/comments/1p3bm2j/seeking_guidance_20_m_and_hoping_to_leave_my/",
    "score": 698,
    "comments": 110,
    "created": "2025-11-21T21:56:44.000Z",
    "text": "Hey everyone,\n\nI’m a 20-year-old living on a Hutterite colony near Swift Current, Saskatchewan. Life here is completely communal. We share everything, from work and meals to faith and daily routines. It’s the only world I’ve ever known. I’ve always done my part with farming, construction, and other “traditional kinds of labour”, and I take pride in working hard. But I’m ready to try new things and see what else I’m capable of outside of this life.\n\nThe truth is, I’m gay, and that isn’t something",
    "keyword": "WorkSafe"
  },
  {
    "id": "1osezam",
    "subreddit": "Edmonton",
    "title": "Anxious driver- winter driving tips?",
    "author": "BlobFishes0",
    "url": "https://reddit.com/r/Edmonton/comments/1osezam/anxious_driver_winter_driving_tips/",
    "score": 0,
    "comments": 100,
    "created": "2025-11-09T09:20:35.000Z",
    "text": "Please give me tips for winter driving in Edmonton. \n\nI am a VERY anxious driver. I am terrified of driving this winter even though I have survived 2 winters with no driving accidents. \n\nI feel like an awful driver and I have cried over driving so many times, even if I didn’t even do anything wrong. I only drive to 3 places- work, my friends house (close to mine), and back home. I don’t trust myself to drive anywhere else without a licensed passenger beside me. \n\nI don’t know why I am so anxious",
    "keyword": "WorkSafe"
  },
  {
    "id": "1on9lrs",
    "subreddit": "Edmonton",
    "title": "Working in Edmonton for 4 months and I require some help.",
    "author": "Durban_Knight22",
    "url": "https://reddit.com/r/Edmonton/comments/1on9lrs/working_in_edmonton_for_4_months_and_i_require/",
    "score": 64,
    "comments": 79,
    "created": "2025-11-03T11:47:05.000Z",
    "text": "Hello everyone!\n\nSo as mentioned in the Title, I am from South Africa, and have been contracted to work in Edmonton from January to April 2026 in your beautiful city. \n\nThis is will be my first time in Canada and I have tried at nauseum to research what to expect in Edmonton, but I have gotten a lot of conflicting information, so I thought, why not try reddit :) \n\nWith that being said, could I please ask for some help regarding the below questions?\n\n1. I know that the period I am visiting is in ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1oymsvf",
    "subreddit": "Edmonton",
    "title": "YEG flights arrive early",
    "author": "Hobbycityplanner",
    "url": "https://reddit.com/r/Edmonton/comments/1oymsvf/yeg_flights_arrive_early/",
    "score": 50,
    "comments": 31,
    "created": "2025-11-16T14:15:45.000Z",
    "text": "edit: 38 minutes for me. Last I could see, scanners are now working and they made it through a significant backlog. should be a more typical experience going through.\n\nGreat work YEG staff. \n\nMods feel free to delete if no longer relevant.\n\nArrive at least an hour before your boarding.\n\nScanners have been down, they are hand screening all bags right now. took 10 minutes just to get into where the queue typically starts.\n\nWill update when I make it through the line with a total wait time\n\nsafe tr",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p6hpnw",
    "subreddit": "Edmonton",
    "title": "Please suggest ideas of locations to donate hand crochet scarves or hats?",
    "author": "Kurbiskitty",
    "url": "https://reddit.com/r/Edmonton/comments/1p6hpnw/please_suggest_ideas_of_locations_to_donate_hand/",
    "score": 16,
    "comments": 9,
    "created": "2025-11-25T16:56:03.000Z",
    "text": "Hey all. \n\nI’m working hard this year to make others smile. \n\nI myself have had a horrible year and been diagnosed with a disease that will affect my entire life going forward. And it’s dark. It’s scary. Unknown. And so to keep my mind busy I have been diving into reading and my crochet hobby. I want to make others smile this year even if my smile is hard to bring to my face right now. \n\nI was thinking first off to do a homeless donation. But then I started to worry about the kids stuck in hospi",
    "keyword": "WorkSafe"
  },
  {
    "id": "1oq9cna",
    "subreddit": "Edmonton",
    "title": "Anyone used the child-minding service at Clareview Rec Centre?",
    "author": "Fun_Yak_4784",
    "url": "https://reddit.com/r/Edmonton/comments/1oq9cna/anyone_used_the_childminding_service_at_clareview/",
    "score": 1,
    "comments": 4,
    "created": "2025-11-06T20:04:59.000Z",
    "text": "Hey everyone,\n\nI’m wondering if anyone has experience with the child-minding service at Edmonton rec centres — especially Clareview. I don’t totally get how it works beyond the idea that you can drop off your kids while you work out or swim.\n\nIf you’ve used it:\n\t•\tHow many caregivers are usually there, especially for babies?\n\t•\tWhat do they actually do with infants (mine are 7 months old)?\n\t•\tHow long can you leave them for?\n\t•\tAny bad experiences or things to watch out for?\n\nTrying to figure ou",
    "keyword": "WorkSafe"
  },
  {
    "id": "1pbp2pe",
    "subreddit": "saskatchewan",
    "title": "Puppy fosters needed",
    "author": "eredekopp",
    "url": "https://reddit.com/r/saskatchewan/comments/1pbp2pe/puppy_fosters_needed/",
    "score": 57,
    "comments": 12,
    "created": "2025-12-01T21:14:56.000Z",
    "text": "Foster homes urgently needed for 4 black lab puppies.\n\nMy wife and I adopted a stray dog who appeared on our friend’s farm in September. We took her to an awful incompetent vet who assured us that she was not pregnant, then she gave birth to 7 puppies a couple weeks later. We decided to raise the puppies with their mother then adopt them out as soon as they’re ready, since that seemed like the right thing to do. \n\nThe puppies are now 10 weeks old and we have 4 of them remaining searching for new",
    "keyword": "WorkSafe"
  },
  {
    "id": "1p6dt5b",
    "subreddit": "saskatoon",
    "title": "https://www.ckom.com/2025/11/24/saskatoon-construction-company-fined-100000-after-falling-wall-injures-worker/",
    "author": "Meowgal_80",
    "url": "https://reddit.com/r/saskatoon/comments/1p6dt5b/httpswwwckomcom20251124saskatoonconstructioncompan/",
    "score": 0,
    "comments": 2,
    "created": "2025-11-25T14:27:31.000Z",
    "text": "",
    "keyword": "injured worker"
  },
  {
    "id": "1pcuka6",
    "subreddit": "saskatoon",
    "title": "SGI Injury lawyer",
    "author": "BCV98",
    "url": "https://reddit.com/r/saskatoon/comments/1pcuka6/sgi_injury_lawyer/",
    "score": 11,
    "comments": 30,
    "created": "2025-12-03T04:22:30.000Z",
    "text": "Hey everyone,\n\n​I'm posting because I'm in a tough spot and need some guidance.\n\n​Last Friday, I was involved in a car accident right here in Saskatoon. The impact unfortunately resulted in an injury that is more serious than I initially thought.\n\n​My doctor has advised me that I will be unable to work until January due to the injury, classifying me as temporarily disabled. This has flipped my life upside down.\n\n​I'm navigating the SGI claims process and need professional help. Does anyone have ",
    "keyword": "disability support"
  },
  {
    "id": "1pe2yus",
    "subreddit": "regina",
    "title": "International Day of Person with Disabilities: Celebrating with a creation of an Accessible parking bylaw",
    "author": "Sarah_Ward5",
    "url": "https://reddit.com/r/regina/comments/1pe2yus/international_day_of_person_with_disabilities/",
    "score": 27,
    "comments": 6,
    "created": "2025-12-04T15:32:06.000Z",
    "text": "Dec 3 was the International Day of Persons with Disabilities. At council, I was proud to move an amendment to the Traffic Bylaws to consider a bylaw focused on accessible parking obstructions.\n\nThe intent is simple and important. When an accessible parking stall is blocked because of events, patios, food trucks or temporary uses of space, it must be replaced with another accessible parking stall. That replacement must consider real accessibility elements like curb cuts and an uninterrupted path ",
    "keyword": "disability support"
  },
  {
    "id": "1onosr5",
    "subreddit": "regina",
    "title": "Beware of Parking lot scam!",
    "author": "bobs-your_uncle",
    "url": "https://reddit.com/r/regina/comments/1onosr5/beware_of_parking_lot_scam/",
    "score": 63,
    "comments": 24,
    "created": "2025-11-03T21:35:00.000Z",
    "text": "\nHad a fella approach me today at Home Depot East in the parking lot. There were others he approached and then drove off. \n\nHe was driving a newer white suburban with Alberta plates so I am just assuming he rented it for this purpose. \n\nHe asked if I wanted an 80” TV for my house. He told me he was delivering a few TVs to a BP because they are upgrading and the company that he picked them up from loaded too many and he doesn’t want to go to BP with all of them so he would give me one for really ",
    "keyword": "WorkSafe"
  },
  {
    "id": "1pcwzp8",
    "subreddit": "Manitoba",
    "title": "Finding a local part time job",
    "author": "Kitty-Pii",
    "url": "https://reddit.com/r/Manitoba/comments/1pcwzp8/finding_a_local_part_time_job/",
    "score": 2,
    "comments": 4,
    "created": "2025-12-03T06:33:43.000Z",
    "text": "Hi, I'm new to Manitoba. I moved here in July. I live in Sperling. I don't have a lot of experience working. The only real experience I do have is working as a dishwasher/server/cook at a diner in Ontario for a year and a half.\n\nI am disabled and afraid to share this with potential employers and have difficulty masking, due to stigma. Because of my disabilities my physical labour is limited. I can't climb ladders of any kind due to high risk of falling Because of balance issues. I can only lift ",
    "keyword": "disability support"
  },
  {
    "id": "1op6pks",
    "subreddit": "Manitoba",
    "title": "Manitoba Teachers Society president critical of universal screening for learning disabilities in schools",
    "author": "wickedplayer494",
    "url": "https://reddit.com/r/Manitoba/comments/1op6pks/manitoba_teachers_society_president_critical_of/",
    "score": 19,
    "comments": 4,
    "created": "2025-11-05T15:59:37.000Z",
    "text": "",
    "keyword": "disability support"
  },
  {
    "id": "1pe9hfe",
    "subreddit": "Winnipeg",
    "title": "Has anyone here successfully applied for MSPD?",
    "author": "Scrumblino",
    "url": "https://reddit.com/r/Winnipeg/comments/1pe9hfe/has_anyone_here_successfully_applied_for_mspd/",
    "score": 4,
    "comments": 6,
    "created": "2025-12-04T19:34:06.000Z",
    "text": "Has anyone been through the process to get on MSPD (Manitoba supports for people with [prolonged, severe] disabilities)? \n\nI haven’t even been able to get an appointment for my wife who has a severe and prolonged disability. Apparently applying is straightforward, but that hasn’t been the experience.\n\nFrom what I’ve gathered, to be eligible for MSPD in my wife’s case, only a financial assessment must be done to see if she financially qualifies. This is because she already has other qualifying fe",
    "keyword": "disability support"
  },
  {
    "id": "1p1x6vj",
    "subreddit": "Winnipeg",
    "title": "Number of Manitobans using MAID levels off",
    "author": "Mylittlethrowaway2",
    "url": "https://reddit.com/r/Winnipeg/comments/1p1x6vj/number_of_manitobans_using_maid_levels_off/",
    "score": 10,
    "comments": 5,
    "created": "2025-11-20T07:39:07.000Z",
    "text": "",
    "keyword": "disability support"
  }
]